{
  "images": [
    {
      "src": "https://framerusercontent.com/images/Pf0HTvGunBGaR91T4DRxKFBHAA.jpg",
      "alt": "Kevon & Audrey looking back at 2024",
      "filename": "blog/2024-1.jpg",
      "context": {
        "before": "January 7, 2025",
        "after": "This year hit differently."
      }
    },
    {
      "src": "https://framerusercontent.com/images/eTqnYEntDnTeoaJqmlf3ORn4JQ.png",
      "alt": "",
      "filename": "blog/2024-2.png",
      "context": {
        "before": ", didn’t sell well, which triggered a spiral of doubt. I decided to rebrand and reconfigure my focus, hoping to bring back growth. Instead, I lost direction.",
        "after": "I thought “building in public” was too generic of a term to focus on and that demand for it had died down. So I rebranded from Public Lab to Small School. I wanted to cover everything around productizing your knowledge to scale your influence."
      }
    },
    {
      "src": "https://framerusercontent.com/images/unUagiL5a6jpTQUz2zjCurM1XOk.jpg",
      "alt": "",
      "filename": "blog/2024-3.jpg",
      "context": {
        "before": "I also had time to meet up with Javier and his family who were visiting Hong Kong. Not only he has been learning from my book and courses all these years, he has also been an active community member. It was awesome finally meeting him in person!",
        "after": "Better Investing"
      }
    },
    {
      "src": "https://framerusercontent.com/images/eOKAhu04al9FPhB1bfbuMCdQSwQ.png",
      "alt": "",
      "filename": "blog/2024-4.png",
      "context": {
        "before": "After four years in business, I was caught in the content-to-product revenue model — spending most of my time creating content and funneling the attention to product sales. The good side is that this is massively scalable, but the downside is that you can’t predict what will happen. This helped me realize I needed a more sustainable business model.",
        "after": "I Was Stubborn"
      }
    },
    {
      "src": "https://framerusercontent.com/images/04hV6uWoRkX5qRc5LAJJ1G0ckM.png",
      "alt": "",
      "filename": "blog/2024-5.png",
      "context": {
        "before": "It reminded me that services can provide stable income while offering opportunities to learn and grow. For people, e.g. new parents, who need a bit more stability, this is good. More importantly, what you learn from offering services can help you build better products too.",
        "after": "4. Collaboration Fuels Energy"
      }
    },
    {
      "src": "https://framerusercontent.com/images/LPvfvusuKTkFTCBOhsdVHErrcDE.png",
      "alt": "",
      "filename": "blog/2024-6.png",
      "context": {
        "before": "Collaboration doesn’t have to be massive to make an impact. It can be small partnerships, like a cross-promotional guest post. At least you get to discuss goals with a partner. I’ve learned that it’s not just about the work—it’s about staying connected to others.",
        "after": "5. Personal Brand > Business Brand"
      }
    }
  ]
}