{
  "images": [
    {
      "src": "https://framerusercontent.com/images/Pf0HTvGunBGaR91T4DRxKFBHAA.jpg",
      "alt": "Kevon & Audrey looking back at 2024",
      "filename": "blog/2024-1.png",
      "context": {
        "before": "2024: A Year of Burnout, Reflection, and Change review January 7, 2025",
        "after": "This year hit differently. Since I set out to build my own business sharing what I know in 2021, I was growing every year, and it was looking like 2024 would be my best year ever. But as I look back on 2024, it’s clear this year wasn’t about breakthroughs or big wins. It was a year that tested my resilience and pushed me to redefine my priorities. In the spirit of transparency, like I always do, I want to talk about what happened, what I learned, and how I’m approaching 2025 with a clearer head and a lighter heart."
      }
    },
    {
      "src": "https://framerusercontent.com/images/eTqnYEntDnTeoaJqmlf3ORn4JQ.png",
      "alt": "",
      "filename": "blog/2024-2.png",
      "context": {
        "before": "But as I look back on 2024, it’s clear this year wasn’t about breakthroughs or big wins. It was a year that tested my resilience and pushed me to redefine my priorities. In the spirit of transparency, like I always do, I want to talk about what happened, what I learned, and how I’m approaching 2025 with a clearer head and a lighter heart. What Actually Happened in 2024 2024 started off strong, but things started going downhill in April. My signature program, Building Public Mastery , didn’t sell well, which triggered a spiral of doubt. I decided to rebrand and reconfigure my focus, hoping to bring back growth. Instead, I lost direction.",
        "after": "I thought “building in public” was too generic of a term to focus on and that demand for it had died down. So I rebranded from Public Lab to Small School. I wanted to cover everything around productizing your knowledge to scale your influence. I quickly poured my energy into the rebrand project but soon I found out it was a huge distraction. I headed into a low period. Finally, in November, I hit pause. It was time to make a drastic change. I began exploring service work with my expertise and built a course for a big-name creator who has 6 million YouTube subscribers and runs a multi-million business (when it is ready, I’ll share more)."
      }
    },
    {
      "src": "https://framerusercontent.com/images/unUagiL5a6jpTQUz2zjCurM1XOk.jpg",
      "alt": "",
      "filename": "blog/2024-3.png",
      "context": {
        "before": "This year, I spent more time with my family than ever before. My daughters, now two and four years old, are at such a magical age. Being present with them during this time is something I’ll always treasure. In a year full of lows, this compensated for it. I also had time to meet up with Javier and his family who were visiting Hong Kong. Not only he has been learning from my book and courses all these years, he has also been an active community member. It was awesome finally meeting him in person!",
        "after": "Better Investing I’ve been dabbling in stock investing since I was 16, but I didn’t feel like I got the game in the last 18 years. 2024 was the year I finally grasped it. Well, I’m not a day trader, so what I mean is that I knew and improved on the art of patience. It’s one thing to know “buy low, sell high” in theory; it’s another to practice it consistently. This year, I finally started executing it better, and I’m proud of that growth. The Lows The lows of 2024 were significant, and they taught me hard but necessary lessons:"
      }
    },
    {
      "src": "https://framerusercontent.com/images/eOKAhu04al9FPhB1bfbuMCdQSwQ.png",
      "alt": "",
      "filename": "blog/2024-4.png",
      "context": {
        "before": "I Was Burned Out I was burned out for much of the year. Solopreneurship felt isolating, and I wasn’t innovating or learning. I am part of Jay Clouse’s private community , and he often says, “Your business growth is tied to your enthusiasm,” and it’s no wonder my business didn’t do too well in 2024. I Was Biased to Product Revenue After four years in business, I was caught in the content-to-product revenue model — spending most of my time creating content and funneling the attention to product sales. The good side is that this is massively scalable, but the downside is that you can’t predict what will happen. This helped me realize I needed a more sustainable business model.",
        "after": "I Was Stubborn I was stuck in doing business my way — I avoided promoting myself too much or repeating ideas, thinking it felt inauthentic. But in reality, successful entrepreneurs know how to push through that discomfort and focus on what the audience wants. It is a balance, but you’ve got to have that ability if you want more success. Key Lessons from 2024 1. Your Calendar Drives Your Business I used to think having an empty calendar meant freedom (so many people still promote this on social media), but this year showed me otherwise. The blank days felt liberating at first, but they quickly turned into aimlessness. I’d find myself filling the time with family activities or small errands, which, while meaningful, didn’t push the business forward."
      }
    },
    {
      "src": "https://framerusercontent.com/images/04hV6uWoRkX5qRc5LAJJ1G0ckM.png",
      "alt": "",
      "filename": "blog/2024-5.png",
      "context": {
        "before": "For years, I was only focusing on the content-to-product revenue model: create content, turn it into a product, and sell it. This approach works well until it is not. Working with clients was a revelation. For the first time in a while, I felt energized by collaborating with someone, tackling their unique challenges, and building something together. It reminded me that services can provide stable income while offering opportunities to learn and grow. For people, e.g. new parents, who need a bit more stability, this is good. More importantly, what you learn from offering services can help you build better products too.",
        "after": "4. Collaboration Fuels Energy As a solopreneur, burnout hit me hard in 2024. I realized I was too isolated, spending most of my time alone at my desk. Bouncing ideas off someone else, solving problems together, and sharing the wins brought a level of energy I hadn’t felt in months. Collaboration doesn’t have to be massive to make an impact. It can be small partnerships, like a cross-promotional guest post. At least you get to discuss goals with a partner. I’ve learned that it’s not just about the work—it’s about staying connected to others."
      }
    },
    {
      "src": "https://framerusercontent.com/images/LPvfvusuKTkFTCBOhsdVHErrcDE.png",
      "alt": "",
      "filename": "blog/2024-6.png",
      "context": {
        "before": "As a solopreneur, burnout hit me hard in 2024. I realized I was too isolated, spending most of my time alone at my desk. Bouncing ideas off someone else, solving problems together, and sharing the wins brought a level of energy I hadn’t felt in months. Collaboration doesn’t have to be massive to make an impact. It can be small partnerships, like a cross-promotional guest post. At least you get to discuss goals with a partner. I’ve learned that it’s not just about the work—it’s about staying connected to others.",
        "after": "5. Personal Brand > Business Brand Lots of people debate building on top of a personal brand or a business brand. Today, I know the answer — for what we do (sharing knowledge), personal brand all the way. For years, I’ve juggled multiple brands—Public Lab, then Small School—but 2024 reminded me that my personal brand, Kevon Cheung , is always the anchor. Business brands evolve or fade based on my changing interest, but a personal brand endures because it’s tied to who you are. This shift in thinking came late in the year as I reflected on why I felt disconnected from my work. I’d diluted my efforts by trying to maintain separate brands, but when I leaned into just being me , things started to click. Moving forward, my personal brand will be my focus."
      }
    }
  ]
}