{
  "images": [
    {
      "src": "https://framerusercontent.com/images/yWCyyehh5oLmTReg7GSo4XqQmkg.jpeg",
      "alt": "",
      "filename": "blog/advice-1.png",
      "context": {
        "before": "Never follow advice from other entrepreneurs entrepreneurship June 6, 2021",
        "after": "If you spend enough time on Twitter, you definitely notice that everyone is sharing a lot of wisdom and best practices in short tweets. Things like these: Create > consume Be consistent in creating content Always 2x the price you want to charge I love this advice because they're vetted by many entrepreneurs. They're usually true with consensus. But if you're a first-time entrepreneur and you're not careful interpreting these wise words, you could be in trouble! Oh no! I consumed content Last Friday, I took out 2 hours of my limited time to consume content. This is an activity that is generally considered ineffective in an entrepreneur's or creator's life."
      }
    },
    {
      "src": "https://framerusercontent.com/images/EQe6Dne0UzPOwTKE5qKazNdgY8.png",
      "alt": "",
      "filename": "blog/advice-2.png",
      "context": {
        "before": "Create > consume Be consistent in creating content Always 2x the price you want to charge I love this advice because they're vetted by many entrepreneurs. They're usually true with consensus. But if you're a first-time entrepreneur and you're not careful interpreting these wise words, you could be in trouble! Oh no! I consumed content Last Friday, I took out 2 hours of my limited time to consume content. This is an activity that is generally considered ineffective in an entrepreneur's or creator's life.",
        "after": "Create more, consume less. That's what everyone is preaching. It is as if consuming content is a bad way to spend time. But I didn't care. Because I have been creating a lot, so I'm totally fine to consume and even write down my thoughts about consuming (like this blog post). I opened a folder in my inbox and started reading all the newsletters I've subscribed to. As I consumed, new ideas and opinions started forming in my head. The content gave me doses of inspiration in different areas. Some helped me think about my existence in this world. Some challenged my way of running a business. Some gave me a new perspective that I've never had."
      }
    },
    {
      "src": "https://framerusercontent.com/images/bddAIXa2W8my1wcSTDGQOg0ywRU.png",
      "alt": "",
      "filename": "blog/advice-3.png",
      "context": {
        "before": "Consuming in an intentional way is good. What's intentional? When I subscribe to the topics and writers that I know can help me improve as an entrepreneur. What's unintentional? Scrolling social media looking at friend's tweets and photos. That's my fine line. This is why the short line \"Create more, consume less\" can be misleading to some. Context behind wisdom The same goes for other wisdom we hear everywhere. \"Be consistent in creating content\" \"Show up every day\" are commonly known in the audience-building and content creation world.",
        "after": "And this creates some questions in many first-time entrepreneurs' minds. \"Is it okay to take a break?\" On one hand, we know why people advise it. In a crowded and perishable social media world, your content comes and goes. If you don't show up every day consistently, you start to lose your audience's attention. Or you can even be penalized by the platforms because they want you to create every single day. But, of course, it is totally okay to take a break for a week and come back later. Your performance might be affected, but taking good care of yourself as an entrepreneur is easily the most important thing."
      }
    },
    {
      "src": "https://framerusercontent.com/images/taPju8Oyy8kAUmmHnWsSWyxV10.png",
      "alt": "",
      "filename": "blog/advice-4.png",
      "context": {
        "before": "Most experienced entrepreneurs like to advise you to always charge more than you think your product is worth. This is because most of us tend to undervalue what we do. It is very easy for experienced entrepreneurs to say that because they’ve gained more credibility along the way (see the Credibility Scale ). Their variables, such as credibility and relationships with customers, have moved up to the next level. And they can charge more because people trust them already. For a first-time entrepreneur, this advice might work or might not work.",
        "after": "It might work if the product is perfectly suited to solve a critical problem and is exceptional. Then this first-time entrepreneur is going to do well. But most of the time, this is not the case. Most first-time entrepreneurs are not good at creating the right solution for the right problem. They also don't have any personal brand or credibility to rely on. In this case, my personal sales philosophy is to charge reasonably or even low. With this approach, you can boost the volume of customers and get more feedback and data points for you to learn about the problem/solution/market. According to the credibility scale , you're also accumulating your credibility because if someone enjoys what you've built, you can put their words up as social proof."
      }
    }
  ]
}