{
  "images": [
    {
      "src": "https://framerusercontent.com/images/eQA3BleCNn559GYEetGLUH43wJo.jpeg",
      "alt": "",
      "filename": "blog/aug-2021-1.png",
      "context": {
        "before": "August 2021 Retrospective & Income Report review September 4, 2021",
        "after": "How am I feeling now? Sometimes, when you're trying new initiatives and then they're over, you feel like you're going back to ground zero to figure out what's next. This is exactly how I'm feeling. I've been running courses for 4 months. Now that they're over, I am building the next thing. I'd say this is a common feeling when you're new in a field and still learning the ropes, so I'm totally okay with it. At the same time, I'm aware that I need to stop the cycle of building → done → building → done."
      }
    },
    {
      "src": "https://framerusercontent.com/images/idTTlnGAlHNwYf91KlkvooIXI.jpeg",
      "alt": "",
      "filename": "blog/aug-2021-2.png",
      "context": {
        "before": "I also got a bit of help running the community engagement side of things. Most people think a community can be self-sustained where members will chat and ask questions freely, but this only happens in very few communities. Someone needs to actively start conversations and invite people to chip in. Currently, my expenses are sitting at 30.5% of revenue. I don't want to go above this percentage and that means I have to increase my revenue with my current resources! What important things happened Launched my 1st info product",
        "after": "Like most Internet products, sales for Use Twitter Meaningfully went up during the launch and then fell nearly flat. It's common. What is important after the launch is how to embed the offering inside the marketing funnel. Clearly, I haven't gotten to that stage yet! Here are my biggest learnings from the launch: Mini products like this rarely get a word-of-mouth effect. They're more revenue-generating products relying on existing credibility and channels. For someone starting out, I don't think they should work on mini products. A big product (book, course, big guide) that is so value-packed and priced right can generate more buzz and credibility. Of course, mini products are great for testing the demand Pricing is hard. I started with $9 and increased $3 for every 20 copies. And then eventually I set it at $18 going forward. I think this is a good strategy giving some sense of urgency during the launch period"
      }
    },
    {
      "src": "https://framerusercontent.com/images/UTYFejmlgsZ3vIFvn4h09Qm0Wts.jpeg",
      "alt": "",
      "filename": "blog/aug-2021-3.png",
      "context": {
        "before": "Mini products like this rarely get a word-of-mouth effect. They're more revenue-generating products relying on existing credibility and channels. For someone starting out, I don't think they should work on mini products. A big product (book, course, big guide) that is so value-packed and priced right can generate more buzz and credibility. Of course, mini products are great for testing the demand Pricing is hard. I started with $9 and increased $3 for every 20 copies. And then eventually I set it at $18 going forward. I think this is a good strategy giving some sense of urgency during the launch period My 1st live teaching experience",
        "after": "Had an absolutely great time with this small group of 6. It was my 1st time running a cohort-based course live style where I taught live on Monday and then we discussed more live on Thursday. What I learned about courses: Cohort-based simply means there is a start date and end date with the group. The course design can vary based on the objective. There are topics that are better suited as self-paced where students take their time to learn and there are topics that are better suited as cohort-based where students learn and work together to improve. This all comes down to the course creator's experience in designing for impact. But - cohort-based courses don’t mean live teaching! There is significant value if the content can be delivered async and the live components are mainly on discussion and connections."
      }
    },
    {
      "src": "https://framerusercontent.com/images/3tLBmlfU9r8GADy99ApBa13vinU.jpeg",
      "alt": "",
      "filename": "blog/aug-2021-4.png",
      "context": {
        "before": "Cohort-based simply means there is a start date and end date with the group. The course design can vary based on the objective. There are topics that are better suited as self-paced where students take their time to learn and there are topics that are better suited as cohort-based where students learn and work together to improve. This all comes down to the course creator's experience in designing for impact. But - cohort-based courses don’t mean live teaching! There is significant value if the content can be delivered async and the live components are mainly on discussion and connections. I'm happy about the outcome of this course:",
        "after": "The ROI of my time In the last 10 months, I've been relying on writing fresh tweets and emails/newsletters as I go. In June 2021, I set out to improve my nurturing funnel and failed. But this time around, I finally got started building a 12-week best content series for anyone coming in through my free products. Here are the reasons: I simply cannot scale my work if I'm still writing content at the very moment The best content usually doesn't come from writing during that week. It is what people find the most valuable and there is data to support it (e.g. open rate, views). By making it evergreen in a nurturing funnel, I make sure everyone gets the best from me"
      }
    },
    {
      "src": "https://framerusercontent.com/images/g2RR3ZjLBvGmv1TQcfH90RJlw.jpeg",
      "alt": "",
      "filename": "blog/aug-2021-5.png",
      "context": {
        "before": "Cohort-based simply means there is a start date and end date with the group. The course design can vary based on the objective. There are topics that are better suited as self-paced where students take their time to learn and there are topics that are better suited as cohort-based where students learn and work together to improve. This all comes down to the course creator's experience in designing for impact. But - cohort-based courses don’t mean live teaching! There is significant value if the content can be delivered async and the live components are mainly on discussion and connections. I'm happy about the outcome of this course:",
        "after": "The ROI of my time In the last 10 months, I've been relying on writing fresh tweets and emails/newsletters as I go. In June 2021, I set out to improve my nurturing funnel and failed. But this time around, I finally got started building a 12-week best content series for anyone coming in through my free products. Here are the reasons: I simply cannot scale my work if I'm still writing content at the very moment The best content usually doesn't come from writing during that week. It is what people find the most valuable and there is data to support it (e.g. open rate, views). By making it evergreen in a nurturing funnel, I make sure everyone gets the best from me"
      }
    },
    {
      "src": "https://framerusercontent.com/images/2qZLnf1iqn9M8oiya2XQIuY5U4.jpeg",
      "alt": "",
      "filename": "blog/aug-2021-6.png",
      "context": {
        "before": "I simply cannot scale my work if I'm still writing content at the very moment The best content usually doesn't come from writing during that week. It is what people find the most valuable and there is data to support it (e.g. open rate, views). By making it evergreen in a nurturing funnel, I make sure everyone gets the best from me I also scaled back from my personal newsletter, Sunday Beam, (again) because I realized it is so much better if I only send something \"when I have something important to say\". People say you have to send frequently to remind people you exist. I think I'm past that phase. You know I'm here, and you want the best from me. After all, if you don’t send a new email, they won’t remember to unsubscribe right? 😂 Invest in meaningful work",
        "after": "There is a lot of urge to work on a lot of things and want to create an empire offering values at different levels to capture everyone. But ... I realized quantity or wide scope of work likely won’t get me to my next stage. When I see Alberto, Rob, and Dylan sharing my long-form article, I know that quality > quantity. I should work on fewer things and make them super duper good. The value should be ridiculous compared to the price point, and this is how I can boost my voice, my credibility, and my influence on the Internet."
      }
    },
    {
      "src": "https://framerusercontent.com/images/1oHTjLSFOqwYlzMdSzIWsKMtws.jpeg",
      "alt": "",
      "filename": "blog/aug-2021-7.png",
      "context": {
        "before": "There is a lot of urge to work on a lot of things and want to create an empire offering values at different levels to capture everyone. But ... I realized quantity or wide scope of work likely won’t get me to my next stage. When I see Alberto, Rob, and Dylan sharing my long-form article, I know that quality > quantity. I should work on fewer things and make them super duper good. The value should be ridiculous compared to the price point, and this is how I can boost my voice, my credibility, and my influence on the Internet. Moved community from Circle to Slack",
        "after": "This has been a question floating in my head for months now. I finally trusted my gut and moved our community . Why? I dug into who my members/audience are and they are mainly early entrepreneurs figuring out their presence on the Internet. Uncertainty and impostor syndrome are common among them. And posting a discussion topic on Circle is difficult for them because 1) it stays there forever and 2) it requires a thoughtful opener Most of them told me that they're part of some other Slack communities or for work. This means they can easily switch around to participate. For Circle, they need to visit a unique link and it becomes the last thing they remember to do"
      }
    },
    {
      "src": "https://framerusercontent.com/images/ks937mUxt8t9Xc4bHp34v4bbcw.png",
      "alt": "",
      "filename": "blog/aug-2021-8.png",
      "context": {
        "before": "Take a mental break - Running a few courses back to back in the last few months was a great learning experience, but even Ironman should rest. It is time to slow down from execution and regroup where I'm heading. Work on a new book/course - As mentioned, big products with ridiculous value are what people care about and talk about. I want to use everything I've learned and taught to put together something extraordinary. Calling it Showing Up Right for now. I'll be building it in public so if you want to get involved with my creation, join me!",
        "after": "Join me on my journey The best way is to subscribe to my newsletter. Subscribe Here © Kevon Cheung 2024 X Threads Instagram YouTube (()=>{function u(){function n(t,e,i){let r=document.createElement(\"a\");r.href=t,r.target=i,r.rel=e,document.body.appendChild(r),r.click(),r.remove()}function o(t){if(this.dataset.hydrated){this.removeEventListener(\"click\",o);return}t.preventDefault(),t.stopPropagation();let e=this.getAttribute(\"href\");if(!e)return;if(/Mac|iPod|iPhone|iPad/u.test(navigator.userAgent)?t.metaKey:t.ctrlKey)return n(e,\"\",\"_blank\");let r=this.getAttribute(\"rel\")??\"\",c=this.getAttribute(\"target\")??\"\";n(e,r,c)}function a(t){if(this.dataset.hydrated){this.removeEventListener(\"auxclick\",o);return}t.preventDefault(),t.stopPropagation();let e=this.getAttribute(\"href\");e&&n(e,\"\",\"_blank\")}function s(t){if(this.dataset.hydrated){this.removeEventListener(\"keydown\",s);return}if(t.key!==\"Enter\")return;t.preventDefault(),t.stopPropagation();let e=this.getAttribute(\"href\");if(!e)return;let i=this.getAttribute(\"rel\")??\"\",r=this.getAttribute(\"target\")??\"\";n(e,i,r)}document.querySelectorAll(\"[data-nested-link]\").forEach(t=>{t instanceof HTMLElement&&(t.addEventListener(\"click\",o),t.addEventListener(\"auxclick\",a),t.addEventListener(\"keydown\",s))})}return u})()()"
      }
    }
  ]
}