{
  "images": [
    {
      "src": "https://framerusercontent.com/images/pYvScyX0YHw4BC0mJOQ1qRO6yk.jpeg",
      "alt": "",
      "filename": "blog/bip-guide-bts-1.png",
      "context": {
        "before": "My guide attracted 2,100 people in 3 days. Here's what I learned marketing February 15, 2021",
        "after": "I was a nobody on the Internet. It took me a total of 2 months and 10,000 words to finish the Building in Public guide , and this happened: 2,100 unique visitors in 3 days, a 73% increase of Twitter followers in 7 days from 767 to 1327, #20 on Hacker News Page 1 for a day, 3 live sharing sessions, and regular mentions of the guide. I had an average of 200-300 users per week until the spike in traffic from the launch. My Twitter had 795 new followers in the last 28 days. The submission made its way up to #20 on page 1 for the day."
      }
    },
    {
      "src": "https://framerusercontent.com/images/qb7URIO6emAYDMgvV2RawkgDfhA.png",
      "alt": "",
      "filename": "blog/bip-guide-bts-2.png",
      "context": {
        "before": "My guide attracted 2,100 people in 3 days. Here's what I learned marketing February 15, 2021 I was a nobody on the Internet. It took me a total of 2 months and 10,000 words to finish the Building in Public guide , and this happened: 2,100 unique visitors in 3 days, a 73% increase of Twitter followers in 7 days from 767 to 1327, #20 on Hacker News Page 1 for a day, 3 live sharing sessions, and regular mentions of the guide.",
        "after": "I had an average of 200-300 users per week until the spike in traffic from the launch. My Twitter had 795 new followers in the last 28 days. The submission made its way up to #20 on page 1 for the day. Were these good results? Heck yeah. Considering I only started this journey in Nov 2020, it was a small step that would be huge when I look back in the future. I want to share some of the key decisions I made about this launch. Grab a coffee and read on. How I started I was the CEO of an angel-backed startup in 2019-2020. Near the end of 2020, I decided it was time to shut down the project because of the lack of growth trajectory."
      }
    },
    {
      "src": "https://framerusercontent.com/images/wGfnpCfCI6afZLIGqU5MGxvFEs.png",
      "alt": "",
      "filename": "blog/bip-guide-bts-3.png",
      "context": {
        "before": "My guide attracted 2,100 people in 3 days. Here's what I learned marketing February 15, 2021 I was a nobody on the Internet. It took me a total of 2 months and 10,000 words to finish the Building in Public guide , and this happened: 2,100 unique visitors in 3 days, a 73% increase of Twitter followers in 7 days from 767 to 1327, #20 on Hacker News Page 1 for a day, 3 live sharing sessions, and regular mentions of the guide. I had an average of 200-300 users per week until the spike in traffic from the launch.",
        "after": "My Twitter had 795 new followers in the last 28 days. The submission made its way up to #20 on page 1 for the day. Were these good results? Heck yeah. Considering I only started this journey in Nov 2020, it was a small step that would be huge when I look back in the future. I want to share some of the key decisions I made about this launch. Grab a coffee and read on. How I started I was the CEO of an angel-backed startup in 2019-2020. Near the end of 2020, I decided it was time to shut down the project because of the lack of growth trajectory."
      }
    },
    {
      "src": "https://framerusercontent.com/images/Ugzq6Su21YrR4tmGWgayXLHk8U4.png",
      "alt": "",
      "filename": "blog/bip-guide-bts-4.png",
      "context": {
        "before": "marketing February 15, 2021 I was a nobody on the Internet. It took me a total of 2 months and 10,000 words to finish the Building in Public guide , and this happened: 2,100 unique visitors in 3 days, a 73% increase of Twitter followers in 7 days from 767 to 1327, #20 on Hacker News Page 1 for a day, 3 live sharing sessions, and regular mentions of the guide. I had an average of 200-300 users per week until the spike in traffic from the launch. My Twitter had 795 new followers in the last 28 days.",
        "after": "The submission made its way up to #20 on page 1 for the day. Were these good results? Heck yeah. Considering I only started this journey in Nov 2020, it was a small step that would be huge when I look back in the future. I want to share some of the key decisions I made about this launch. Grab a coffee and read on. How I started I was the CEO of an angel-backed startup in 2019-2020. Near the end of 2020, I decided it was time to shut down the project because of the lack of growth trajectory. I gave myself some time to figure out what was next, and I was fascinated by the idea of establishing my own voice on the Internet. I didn't know personal blogging could be so influential, in addition to being a strong self-reflective tool."
      }
    },
    {
      "src": "https://framerusercontent.com/images/9DoI34eRmXJSjCIhsHMZS4HrBY.png",
      "alt": "",
      "filename": "blog/bip-guide-bts-5.png",
      "context": {
        "before": "A launch can give you a spike in traffic and more awareness, but it is never going to get you to your goal overnight. 2,100 unique visitors in 3 days were amazing to me, but I like to break it down a little bit: what do these 2,100 people mean to me? They're the early readers of my guide. Some find it useful, and some don't. Some will bookmark this guide and come back later, and some will completely forget about it. Some will remember me as the author and refer to their friends when they have questions about Building in Public.",
        "after": "These are the rewarding moments since the launch. Honestly, the truth is I don't know. What I know is that I started to create a small piece of knowledge real estate that belongs to me, and hopefully, it will have a sustainable impact in the days to come. This is why I don't have an expectation of what this launch can potentially bring me. What is more important is that more people will see how I can help and we get to start some conversations. 3. I'm interested in SEO If you've read my newsletters , you know I'm someone who values long-term impact and does not mind taking baby steps to get there. When I started to build my personal voice, my goal was to establish my website and rank well via SEO."
      }
    },
    {
      "src": "https://framerusercontent.com/images/0gyEacf1yuDsoSgEDH7haoArg8.png",
      "alt": "",
      "filename": "blog/bip-guide-bts-6.png",
      "context": {
        "before": "A launch can give you a spike in traffic and more awareness, but it is never going to get you to your goal overnight. 2,100 unique visitors in 3 days were amazing to me, but I like to break it down a little bit: what do these 2,100 people mean to me? They're the early readers of my guide. Some find it useful, and some don't. Some will bookmark this guide and come back later, and some will completely forget about it. Some will remember me as the author and refer to their friends when they have questions about Building in Public.",
        "after": "These are the rewarding moments since the launch. Honestly, the truth is I don't know. What I know is that I started to create a small piece of knowledge real estate that belongs to me, and hopefully, it will have a sustainable impact in the days to come. This is why I don't have an expectation of what this launch can potentially bring me. What is more important is that more people will see how I can help and we get to start some conversations. 3. I'm interested in SEO If you've read my newsletters , you know I'm someone who values long-term impact and does not mind taking baby steps to get there. When I started to build my personal voice, my goal was to establish my website and rank well via SEO."
      }
    },
    {
      "src": "https://framerusercontent.com/images/LSgyUTnjAzZyaRIUvJ5JBx7QxN4.png",
      "alt": "",
      "filename": "blog/bip-guide-bts-7.png",
      "context": {
        "before": "I'm interested in social media, but organic search engine traffic sounds a lot more attractive to me. I did that for my startup , but doing it for a personal site is like 10x harder. Since my website is fairly new, I have a domain rating (DR) of 2. It is miserable. Getting enough traffic to prove that my website is useful and getting backlinks are two factors that play into the algorithm. Getting backlinks is out of the question for someone like me with no content and credibility, so getting some traffic to tell Google that I'm a serious content creator would be my first step.",
        "after": "Domain rating (DR) plays a big part in getting your site's content ranked. After I launched the guide, I received a spike in traffic which was good. I checked my domain rating again and it went from 2 to 3.9, then to 3.6, then to 2.5. I wasn't exactly sure what happened there, but I knew the effect from this launch likely hasn't kicked in yet, or maybe it will never kick in. I know it'd be a tough battle in the early days, but if I stay consistent, one day this will pay off. How I approached creating this guide"
      }
    },
    {
      "src": "https://framerusercontent.com/images/aHxVzdLilOBaQ6VbmpLBQ9e40sA.png",
      "alt": "",
      "filename": "blog/bip-guide-bts-8.png",
      "context": {
        "before": "I had a total of 9 early readers, and they weren't just there to point out grammar mistakes. They were giving me feedback on the structure of the content, whether a particular paragraph made sense, and if they found the chapter useful. With their feedback, I kept editing the guide by cutting out unnecessary words and rephrasing sentences so they're easy to understand. How did I find them? I tweeted about my guide a number of times and I asked if anyone would be interested in being an early (beta) reader and to give feedback. The relationships I've built helped and a few people said yes.",
        "after": "4. Using a ton of real examples From my own experience reading a guide, I always prefer something that is practical and actionable. Theories are important, but it'd help me a lot if I could take action now. With that, using real examples would be my approach to writing this guide. So when I was researching, I noted down which example would be great for which chapter and talking point. Once I added these examples to my chapters , I made sure to include a profile picture of everyone and a link to their Twitter or websites. If I was going to use someone's work as an example, I better give them enough respect."
      }
    },
    {
      "src": "https://framerusercontent.com/images/BGaZDjb9LxJ1yrNWrSi11C768.png",
      "alt": "",
      "filename": "blog/bip-guide-bts-9.png",
      "context": {
        "before": "I kept a list of everyone who was included as an example, who helped as an early reader, and who expressed interest in the full guide. When it finally launched, I sent a quick message to every one of them (except if they're quite a big name and my chance is slim) sharing that the guide was out and asking if they'd mind helping retweet it. I made sure to let them know that it was completely okay if it didn't fit into their social profile as it was a big ask. 2. I kept talking about Building in Public To make sure there would be consistent exposure before and after the launch, I had to keep bringing this topic up. What I did was extract key points from my guide and write a bunch of short tweets. I then used Hootsuite to schedule 2 tweets per week, and it started even before the guide was launched. This way I was gradually building up my voice on this topic.",
        "after": "Remixing the content from the guide into short tweets. 3. Be grateful and give people credits The Internet is a big playground and to succeed, you have to think beyond yourself. You have to understand that to create a piece of useful content, most of the time it is not your own work. Without having these people as my examples, my guide wouldn't be as educational and valuable. So I made sure to give credit to every one of these amazing people in the first chapter and my tweet threads. I linked to all of their Twitter accounts and their websites or products."
      }
    },
    {
      "src": "https://framerusercontent.com/images/PhWafL3CXhmV9Hh8KJctmYo8.gif",
      "alt": "",
      "filename": "blog/bip-guide-bts-10.png",
      "context": {
        "before": "It has only been 7 days, so I don't quite have enough data to say how far this guide can go. The launch traffic has inevitably died down after a few days. But to me, I can already see that my \"small potato\" status on the Internet is evolving a little bit. People are sharing the guide with one another and starting to tag me as a go-to person for Building in Public. The most exciting part of the launch was definitely seeing how many people were on my website at the same time right after the launch. 50+ people reading at the same time? Wow!",
        "after": "Lastly, I'm not exactly sure what the next step is. The main question is: in addition to a written guide, how can I create more value to help people build in public? I'll surely be paying attention to signals from people to figure out the next step! Join me on my journey The best way is to subscribe to my newsletter. Subscribe Here © Kevon Cheung 2024 X Threads Instagram YouTube (()=>{function u(){function n(t,e,i){let r=document.createElement(\"a\");r.href=t,r.target=i,r.rel=e,document.body.appendChild(r),r.click(),r.remove()}function o(t){if(this.dataset.hydrated){this.removeEventListener(\"click\",o);return}t.preventDefault(),t.stopPropagation();let e=this.getAttribute(\"href\");if(!e)return;if(/Mac|iPod|iPhone|iPad/u.test(navigator.userAgent)?t.metaKey:t.ctrlKey)return n(e,\"\",\"_blank\");let r=this.getAttribute(\"rel\")??\"\",c=this.getAttribute(\"target\")??\"\";n(e,r,c)}function a(t){if(this.dataset.hydrated){this.removeEventListener(\"auxclick\",o);return}t.preventDefault(),t.stopPropagation();let e=this.getAttribute(\"href\");e&&n(e,\"\",\"_blank\")}function s(t){if(this.dataset.hydrated){this.removeEventListener(\"keydown\",s);return}if(t.key!==\"Enter\")return;t.preventDefault(),t.stopPropagation();let e=this.getAttribute(\"href\");if(!e)return;let i=this.getAttribute(\"rel\")??\"\",r=this.getAttribute(\"target\")??\"\";n(e,i,r)}document.querySelectorAll(\"[data-nested-link]\").forEach(t=>{t instanceof HTMLElement&&(t.addEventListener(\"click\",o),t.addEventListener(\"auxclick\",a),t.addEventListener(\"keydown\",s))})}return u})()()"
      }
    }
  ]
}