{
  "images": [
    {
      "src": "https://framerusercontent.com/images/Pms1mGzCzzzRb4kqYY1632hxPSc.jpeg",
      "alt": "",
      "filename": "blog/build-new-community-1.png",
      "context": {
        "before": "How I build a new community using data and feedback entrepreneurship April 4, 2021",
        "after": "I loved taking out my huge whiteboard and started brainstorming ideas by myself or with my buddies. I thought that one whiteboard would help me change the world. I kept throwing ideas on the board, hoping to find the perfect solution to the perfect problem. After doing that for about 8 years now, I finally came to the conclusion that brainstorming and whiteboarding to come up with a business idea is a waste of time and effort. I was creating inside my own head and was completely detached from the real world."
      }
    },
    {
      "src": "https://framerusercontent.com/images/SkhIyP8VfvqiBpkPA53tDjPW0U.png",
      "alt": "",
      "filename": "blog/build-new-community-2.png",
      "context": {
        "before": "Is that even possible? Step-by-step on how I found my way to launching a private community 1) Quickest way to gauge interest Ever since I rolled out the Building in Public Definitive Guide , a lot of people have reached out to me telling me their interests in a supportive ecosystem. They understood the mindset and how it could help their work, yet resources and a support system weren’t there for them. I didn't know whether this was true or if there were enough people to create a sustainable community.",
        "after": "So I resorted to a tweet thread to help me figure this out. I spent about an hour crafting up an initial idea and made a graph explaining the offering, both free and paid. 2) Getting initial data This one tweet led to 19 responses. Not bad for a single tweet. And I learned more about what people wanted to achieve as they started to build in public. The form gave me important insights: 100% of people wanted a free buddy system 58% of people wanted a paid group 68% of people wanted a \"building in public\" course 58% of people wanted a storytelling course"
      }
    },
    {
      "src": "https://framerusercontent.com/images/5paVl3AUk9yopLbXLa7Xnc0AU.png",
      "alt": "",
      "filename": "blog/build-new-community-3.png",
      "context": {
        "before": "Out of the 9 people, only 6 were active. Yet, we had a super good time helping each other. One day, someone shared their new Building in Public tweet and others gave feedback. The other day, someone pitched their new product idea and got fair comments from other builders. The dynamic of the group was good. To me, that was the most important thing because with any community or group, it always comes down to people's interactions. I kept asking questions in the group and seeking insights on what to do next.",
        "after": "I also facilitated the group's interactions a little. 5) Debating with myself At this point, I was still hesitant to run a full-on community. A lot of people think running a community is easy. You put together a group of people and they are going to interact with each other. But my last SaaS startup touched upon virtual communities and the experience told me otherwise. When you build a SaaS tool, as long as each user is getting the value, you'll do okay. But when you run a community, you're handling people with different styles and the dynamic is ever-changing."
      }
    },
    {
      "src": "https://framerusercontent.com/images/6P9ubjVHtE17v3DtSyeOMKz0TNQ.png",
      "alt": "",
      "filename": "blog/build-new-community-4.png",
      "context": {
        "before": "Yet, we had a super good time helping each other. One day, someone shared their new Building in Public tweet and others gave feedback. The other day, someone pitched their new product idea and got fair comments from other builders. The dynamic of the group was good. To me, that was the most important thing because with any community or group, it always comes down to people's interactions. I kept asking questions in the group and seeking insights on what to do next. I also facilitated the group's interactions a little.",
        "after": "5) Debating with myself At this point, I was still hesitant to run a full-on community. A lot of people think running a community is easy. You put together a group of people and they are going to interact with each other. But my last SaaS startup touched upon virtual communities and the experience told me otherwise. When you build a SaaS tool, as long as each user is getting the value, you'll do okay. But when you run a community, you're handling people with different styles and the dynamic is ever-changing."
      }
    },
    {
      "src": "https://framerusercontent.com/images/4NprCrM515AHTLWbFGxjMTtFu8.png",
      "alt": "",
      "filename": "blog/build-new-community-5.png",
      "context": {
        "before": "And with a newborn, I wasn't sure if I could commit to such a project. I struggled to move forward. 6) What changed my mind Then the next week, a number of things happened. Thing A I was chatting with the Twitter DM group members individually and they gave me confirmation that I was helping them in their journey, something even beyond building in public. I was definitely flattered by their kind words, and I started to believe a community is where I can bring the most value to the people around me after releasing the definitive guide.",
        "after": "Thing B I studied more about virtual communities. There is Circle which is a forum style, and there is Slack which is a live messaging style. Personally, I stopped getting on Slack because the number of messages in different communities was getting out of control. I was super overwhelmed. Many Slack communities became places for people to dump their links and content. I didn't enjoy it. But for Circle, it seems to be asynchronous. Members can take their time to engage and they can also take a step back if they want to."
      }
    },
    {
      "src": "https://framerusercontent.com/images/VFe3bjGflqC1gnF91pAzHYkJNY.png",
      "alt": "",
      "filename": "blog/build-new-community-6.png",
      "context": {
        "before": "But for Circle, it seems to be asynchronous. Members can take their time to engage and they can also take a step back if they want to. I also learned that as a community builder, if I can set up a good foundation and a regular rhythm to facilitate, it doesn't require my \"live attention\" as I previously thought. A lot of it can be asynchronous! Thing C Just for fun, I set up a gathering for indie builders to meet 1:1. The event went super well and people loved it. They also shared that they loved the way I ran it. This gave me another confidence boost about my facilitation ability.",
        "after": "With these 3 events over that week, I decided to give it a shot to expand the small group into a larger community for Building in Public. And I had to get to work: setting up Circle, figuring out membership & payment, building a website, etc. Lots of work! 7) Finding the early members There was a lot of groundwork I needed to get done, but I knew finding more active, engaging early members was my top priority. After all, I only had 6 people. Of course, I wrote a tweet to find them. The early culture of a community is crucial. I wanted to find people I might have already interacted with on Twitter who are supportive givers. They must enjoy interacting and helping one another."
      }
    },
    {
      "src": "https://framerusercontent.com/images/PkYSv4YaWrkRZxWKLy0qEvox1lw.png",
      "alt": "",
      "filename": "blog/build-new-community-7.png",
      "context": {
        "before": "This gave me another confidence boost about my facilitation ability. With these 3 events over that week, I decided to give it a shot to expand the small group into a larger community for Building in Public. And I had to get to work: setting up Circle, figuring out membership & payment, building a website, etc. Lots of work! 7) Finding the early members There was a lot of groundwork I needed to get done, but I knew finding more active, engaging early members was my top priority. After all, I only had 6 people. Of course, I wrote a tweet to find them.",
        "after": "The early culture of a community is crucial. I wanted to find people I might have already interacted with on Twitter who are supportive givers. They must enjoy interacting and helping one another. I kept a list of all the people who were interested and split them into batches so I could invite them later. 8) Finally, the community was up! After about a week of intense groundwork, the Public Lab community was finally set up. There was just one problem - it was a bare shell and didn't look like a community."
      }
    },
    {
      "src": "https://framerusercontent.com/images/G9K34bk9YziZY4V99AVe3L65zb0.png",
      "alt": "",
      "filename": "blog/build-new-community-8.png",
      "context": {
        "before": "The early culture of a community is crucial. I wanted to find people I might have already interacted with on Twitter who are supportive givers. They must enjoy interacting and helping one another. I kept a list of all the people who were interested and split them into batches so I could invite them later. 8) Finally, the community was up! After about a week of intense groundwork, the Public Lab community was finally set up. There was just one problem - it was a bare shell and didn't look like a community. I made sure to thank my early builders to be patient with me as I continued to work on setting up the foundation and facilitating the group to get started.",
        "after": "Carrying forward the spirit of Building in Public, I also decided to build this community in public. On one hand, I want to share my learnings building a community as a newbie with everyone via blog posts like this. On another hand, I want to open up the community's roadmap each month to let all the members know what I'm working on and get them involved. I can only see the upside of being transparent about this whole process if we want to create a strong-cultured community. After all, it is not as important what I think the community members need as what they actually need."
      }
    },
    {
      "src": "https://framerusercontent.com/images/6PSCCKbqQ2WjwggwZApRZmjqY4.png",
      "alt": "",
      "filename": "blog/build-new-community-9.png",
      "context": {
        "before": "The closest I've gotten to running an online community was running a forum with 10,000+ members when I was 15. But, it was a different experience. Back then, the forum was for a local singer so the focal point was very clear - her! Now, Public Lab was built on top of a mindset. The backbone of this community is education and learning. And I need to make sure it is bringing value to every member constantly. I shared this fact with the 20 early builders on the Public Lab community so they can have the right expectation and involvement to do this together.",
        "after": "4) Take baby steps I cannot stress enough the importance of taking slow baby steps. Whenever I moved fast in my previous startups, I made all the wrong decisions. When I launched the Building in Public Definitive Guide or the email course, Making Twitter Friends , I also took baby steps to roll it out. This is why I'm in no rush to open the Public Lab community up to everyone. My plan is to bring in batches of 20 people at a time so that we're creating a sustainable community. If you're interested to get on the waitlist, check out the Public Lab's website ! See you there."
      }
    }
  ]
}