{
  "images": [
    {
      "src": "https://framerusercontent.com/images/w6Di4GzgBXUZcaCxiskyOc9XQw.jpeg",
      "alt": "",
      "filename": "blog/cohort-based-learning-1.png",
      "context": {
        "before": "Will cohort-based learning be the future? teaching & learning February 28, 2021",
        "after": "We keep forgetting one simple truth. We humans are tribal. When I came across a new platform called Contra and offered my suggestions to optimize their landing pages , I learned that they are creating a community for the future of work. And I started thinking about what \"humans are tribal\" means to the future of our education and work. If we're tribal, why do we grow communities to thousands of people knowing that we'd lose touch with it? What sort of communities will empower people to learn and work in the best way?"
      }
    },
    {
      "src": "https://framerusercontent.com/images/wSFu9K2nT1uG8YblKCjpUrHREy8.jpeg",
      "alt": "",
      "filename": "blog/cohort-based-learning-2.png",
      "context": {
        "before": "We keep forgetting one simple truth. We humans are tribal. When I came across a new platform called Contra and offered my suggestions to optimize their landing pages , I learned that they are creating a community for the future of work. And I started thinking about what \"humans are tribal\" means to the future of our education and work. If we're tribal, why do we grow communities to thousands of people knowing that we'd lose touch with it? What sort of communities will empower people to learn and work in the best way? The death of large communities",
        "after": "Large communities are losing their charms. When I think about the concept of a community, I see a group of like-minded people gathering around a bonfire. They're talking about their meanings in life and they're engaging in conversations that help each other get closer to their goals. In my mind, when Slack created a whole new meaning of communities that power thousands of people online, that image of a community faded out. From that onwards, I started to see larger and larger community groups being formed. The communities had great missions that brought together their members, yet not a lot of them were engaging enough to keep people around."
      }
    },
    {
      "src": "https://framerusercontent.com/images/advFkK2OZcdohiysPvyC5ppWN6E.jpeg",
      "alt": "",
      "filename": "blog/cohort-based-learning-3.png",
      "context": {
        "before": "All meaningful relationships, including online ones, happen because of a mutual exchange. But as a community grows in size, the ratio of genuine exchange tends to fall because of the number of disengaged members. And it often snowballs until the community becomes just a place for people to spam their links and articles. Lack of incentive to go back Everyone is occupied with their own priorities in life. There is no reason for someone to revisit a community when they don't get recognized or have anyone to exchange values with. A tribal era emerging",
        "after": "Smaller cohorts encourage people to build authentic relationships to support each other. When large online communities become unwelcoming, there are more smaller groups being formed around the Internet. 20-50 people groups are set up on Twitter to share their latest content and discuss their views on timely topics. These groups are more engaging because the small size allows everyone to know one another. The cozy environment also encourages closer relationships and more open conversations. The members also keep one another accountable to push their work forward."
      }
    }
  ]
}