{
  "images": [
    {
      "src": "https://framerusercontent.com/images/4BZxMNThso6SqlUhVFjnzXcTPMA.jpeg",
      "alt": "",
      "filename": "blog/community-or-cohort-based-course-1.png",
      "context": {
        "before": "How to decide between starting a community and a cohort-based course teaching & learning May 1, 2021",
        "after": "Are you thinking about starting a new community or creating a cohort-based course? They're the hottest products to create in 2021. But before you do so, read this. I've been writing about Building in Public and it brings me a lot of people who want to get started yet struggling to find ways. What they need is not a tech tool to help them build in public. Instead, they want to learn the fundamentals, have the accountability to push through the start, and have a support ecosystem. And so I began to"
      }
    },
    {
      "src": "https://framerusercontent.com/images/dSNnCFhoULkxK4lTAlqzoaQqTc.png",
      "alt": "",
      "filename": "blog/community-or-cohort-based-course-2.png",
      "context": {
        "before": "And so I began to build a private community for #BuildingInPublic that would become a safe space for these builders to gather and support one another. But from interacting with the members, I realized what's more helpful in their early journey is to push for the #BuildingInPublic mindset in a fixed timeframe. And that's when I created the cohort-based course. Here I'm breaking down and comparing what I learned from creating these two products. This can help you think through how you want to approach creating them.",
        "after": "A community is a commitment An online community is asynchronous. It runs in the background for most people's lives. Most people are not visiting the community all the time, but they go there when they want to interact with the other members. It could be asking questions, sharing their newest learnings, or just being part of a committed group of like-minded people. Because they only go to a community when they need it, it requires them to be self-driven. They know their role in the community and they know what they want. They're responsible for their own learning curve."
      }
    }
  ]
}