{
  "images": [
    {
      "src": "https://framerusercontent.com/images/1joAJu0vt0gjaufsZzTGQpVITgg.jpeg",
      "alt": "A person looking at their laptop screen, contemplating online business",
      "filename": "blog/credibility-1.jpeg",
      "context": {
        "before": "Let's say there are two gardeners: John and Jenn.\n\nBoth are capable of maintaining your lawn, how would you choose which one to hire?\n\nIt is likely not how they look. Not how they talk. Not how many years of experience they have.\n\nIt comes down to one thing.\n\nWho do you trust more to do an excellent job?\n\nIf Jenn has a website with recommendations from happy customers and her story is featured in the Gardener Magazine, and John has nothing but a business card, you're going to instantly raise Jenn's credibility level and choose her for the job.",
        "after": "Why's that?\n\nOur brain is wired in a special way that we make decisions based on credibility, not perceived value. We build up trust based on the information we see and let that influence our decisions.\n\nOnce the credibility is established, whatever a person says or does, it is always better."
      }
    },
    {
      "src": "https://framerusercontent.com/images/hb4SgyMkqLvJORbmJOrPF9Rxw.png",
      "alt": "Screenshot of a Twitter thread about building in public",
      "filename": "blog/credibility-2.png",
      "context": {
        "before": "## Start with baby steps\n\nThe first step is to start small. Don't try to build a massive product or create a huge course right away. Instead, focus on small wins that you can achieve quickly.\n\nFor example, when I started building in public, I didn't immediately try to build a SaaS product. I started by sharing my journey of learning to code and building small projects.",
        "after": "These small wins helped me build confidence and credibility. People could see that I was actually doing the work, not just talking about it.\n\nMore importantly, these small wins gave me social proof. When people saw others engaging with my content and validating my work, they were more likely to trust me."
      }
    },
    {
      "src": "https://framerusercontent.com/images/gZh2RJVg75WXqoZ7gjWdFSXmsI.png",
      "alt": "Screenshot showing social proof and endorsements",
      "filename": "blog/credibility-3.png",
      "context": {
        "before": "## Get endorsed by real people\n\nThe next step is to get endorsements from real people. This doesn't mean you need celebrities or influencers to vouch for you. Start with your peers, colleagues, and early customers.",
        "after": "When people see others vouching for your work, they're more likely to trust you. This is why testimonials and case studies are so powerful.\n\nBut don't wait until you have a perfect product to start collecting endorsements. Share your work in progress and ask for feedback. The feedback itself becomes a form of social proof."
      }
    },
    {
      "src": "https://framerusercontent.com/images/JKIYsRleBnbg4Ks2NGmexwvtg.png",
      "alt": "Screenshot of project documentation and evidence",
      "filename": "blog/credibility-4.png",
      "context": {
        "before": "## Accumulate evidence\n\nThe final step is to accumulate evidence of your work. This means documenting your journey, sharing your process, and building in public.",
        "after": "Evidence can take many forms:\n- Blog posts about your learnings\n- Videos showing your work in progress\n- Code repositories on GitHub\n- Design files on Figma\n- Screenshots of customer conversations\n\nThe key is to make your work visible and verifiable. When people can see the evidence of your work, they're more likely to believe in your ability to deliver."
      }
    },
    {
      "src": "https://framerusercontent.com/images/GZzUZyZbOcwMR5eoDybLL6pCnEs.jpeg",
      "alt": "A person working on their laptop, building their online presence",
      "filename": "blog/credibility-5.jpeg",
      "context": {
        "before": "## Start building your credibility today\n\nBuilding credibility takes time, but it doesn't have to take years. By following these steps, you can start building credibility today:\n\n1. Start with baby steps and focus on small wins\n2. Get endorsements from real people\n3. Accumulate and share evidence of your work",
        "after": "Remember, everyone starts from zero. The key is to start somewhere and keep building.\n\nDon't let the credibility gap stop you from making money online. Start small, be consistent, and let your work speak for itself.\n\nThe sooner you start, the sooner you'll bridge that gap."
      }
    }
  ]
}