{
  "images": [
    {
      "src": "https://framerusercontent.com/images/1joAJu0vt0gjaufsZzTGQpVITgg.jpeg",
      "alt": "A person looking at their laptop screen, contemplating online business",
      "filename": "blog/credibility-1.png",
      "context": {
        "before": "What's stopping you from making money online entrepreneurship March 14, 2021",
        "after": "Let's say there are two gardeners: John and Jenn. Both are capable of maintaining your lawn, how would you choose which one to hire? It is likely not how they look. Not how they talk. Not how many years of experience they have. It comes down to one thing. Who do you trust more to do an excellent job? If Jenn has a website with recommendations from happy customers and her story is featured in the Gardener Magazine, and John has nothing but a business card, you're going to instantly raise Jenn's credibility level and choose her for the job."
      }
    },
    {
      "src": "https://framerusercontent.com/images/hb4SgyMkqLvJORbmJOrPF9Rxw.png",
      "alt": "Screenshot of a Twitter thread about building in public",
      "filename": "blog/credibility-2.png",
      "context": {
        "before": "If Jenn has a website with recommendations from happy customers and her story is featured in the Gardener Magazine, and John has nothing but a business card, you're going to instantly raise Jenn's credibility level and choose her for the job. Why's that? Our brain is wired in a special way that we make decisions based on credibility, not perceived value. We build up trust based on the information we see and let that influence our decisions. Once the credibility is established, whatever a person says or does, it is always better. This is why testimonials and social proof have become a big part of the online world. I put up this wall by Testimonial on my homepage to let people instantly find out whether I'm trustworthy.",
        "after": "This is what I have on KevonCheung.com's homepage. But, the important question is: When tech founders and creators are just starting out, how can they effectively build up their online credibility? How should they think about it? Break it down into baby steps This is my way of breaking down how human perceives credibility. If it is very hard to achieve one thing, and you achieve it, we tend to think you're qualified to get there. And that makes you more trusted. Here are some examples. It \"must be\" extremely hard to meet with the President. If Jessica has done that, she must be a qualified person to meet with the President."
      }
    },
    {
      "src": "https://framerusercontent.com/images/gZh2RJVg75WXqoZ7gjWdFSXmsI.png",
      "alt": "Screenshot showing social proof and endorsements",
      "filename": "blog/credibility-3.png",
      "context": {
        "before": "I use quotations on \"must be\" because it is all about how hard we perceive the task to be. Everyone could have a different level of difficulty. For example, if your uncle happens to know Barack Obama, then it is not surprising that you could easily get a photo with the former President at a country club. So every achievement is placed on a scale from easy to achieve to hard to achieve. Achieving closer to the easy side means you'd gain a tiny bit of credibility, and closer to the hard side means a ton of credibility. If we put this concept into the online world, the scale looks like this:",
        "after": "These are the most common achievements for tech founders and creators. Can you point out where your credibility level is right now? To be able to achieve something on the harder side of the scale, you need credibility from things that come from the easier side. If your dream is to become a book author and you haven't published any articles or done any interviews, your chance of success is slim because you don't have credibility. But if you have an active Twitter account with 5,000 followers and have written dozens of articles on this topic, you've built up your credibility to be qualified to launch a book."
      }
    },
    {
      "src": "https://framerusercontent.com/images/JKIYsRleBnbg4Ks2NGmexwvtg.png",
      "alt": "Screenshot of project documentation and evidence",
      "filename": "blog/credibility-4.png",
      "context": {
        "before": "When someone endorses your name or work, it is a strong signal of trust because they're associating their reputation with your reputation. And this is not something we do for anybody. More importantly, this person's credibility level spills over to your credibility level. For example, if Elon Musk says you're the man to watch in the micro-SaaS space. Then you get his credibility level, which is a huge jump. I was endorsed by Preetam Nath who has 5,000+ followers and is an influencer in the SaaS space. This helped me a lot.",
        "after": "Once you get that going. When you can get different respected people to endorse you regularly, you're establishing yourself as \"somebody\". To get an endorsement, it is almost always based on strong and mutual relationships. Building an audience has been a popular trend recently. Everyone is busy growing their social following. Most beginners focus on the follower count, while people who deeply understand how this works know that it is based on meaningful relationships and interactions. Online success depends on online relationships. And to have those, you have to understand how online relationships work and the techniques to craft them."
      }
    },
    {
      "src": "https://framerusercontent.com/images/GZzUZyZbOcwMR5eoDybLL6pCnEs.jpeg",
      "alt": "A person working on their laptop, building their online presence",
      "filename": "blog/credibility-5.png",
      "context": {
        "before": "Online success depends on online relationships. And to have those, you have to understand how online relationships work and the techniques to craft them. I created a free email course, Making Twitter Friends , to share my techniques for building meaningful online relationships. Accumulate evidence Unless you're a celebrity with a manager, no one is going to promote you, except yourself. You want to take every chance to capture positive things people say about you. It could be a tweet, a post, an email, a written note, or anything. Do yourself a favor. Be your own promoter.",
        "after": "I love Testimonial.to - easy to use and does the job! So far, Testimonial.to is the best tool for capturing social proof (example here & here ). You can use this link to get 15% off . If you're the type of person who sees this as bragging, then do this with me. Think of that one person online you admire a lot. What is her online personality like? Does she post endorsement notes given by other people? Chances are she is genuine and kind and you absolutely enjoy her presence. And chances are she occasionally posts endorsements on her social account."
      }
    }
  ]
}