{
  "images": [
    {
      "src": "https://framerusercontent.com/images/yg5WohtDBpGNslgfQZb3uh9C0Jw.jpeg",
      "alt": "",
      "filename": "blog/get-more-time-1.png",
      "context": {
        "before": "How to get more time in your day life Lessons December 22, 2020",
        "after": "I'm a productivity nerd. When I waste time, I always feel a sense of guilt. For example, I do not allow myself to sleep more than 7 hours unless it is a very special occasion like I'm very sick. If I need a nap, it has to be between 10-20 minutes maximum. When I'm commuting, I must be reading or listening to a podcast. For some reason, the concept of wasting time daunts me. And I'm sure it is not just me - it's probably why so many people are on their phones on the train or bus. Everyone wants to feel productive with their time."
      }
    },
    {
      "src": "https://framerusercontent.com/images/jJci7Pz1hXAsJMVwgtAA727MH4.jpeg",
      "alt": "",
      "filename": "blog/get-more-time-2.png",
      "context": {
        "before": "How I reduce decision fatigue One thing you should also know, that decision fatigue is real . If a person has to make a lot of decisions within a period, he or she might start making poor choices. There are so many decisions each one of us has to make each day, and the key is to find out what matters to you most to want to keep having to make that decision, and what matters least to you so you can remove the need to make such a decision completely. Let's take my day as an example. Start of the day: exercise and breakfast",
        "after": "My best day routine. I figured out a daily routine of waking up at 6:30 am, running from 7-8 am, and having breakfast at 8:15 am gives me the best start for my day. And therefore, I don't need to decide what to do each morning. I simply do this every single day. Next, thinking about what to eat for breakfast can easily consume 5-15 minutes of my time each day. I know myself well enough that I care more about the nutrition of my food than the excitement of trying new food for breakfast. Hence, I'm sticking to my usuals such as sweet potato, banana, boiled eggs, toast, avocado, muesli, and yogurt. I have all this stock, and every day I just grab what I feel like from the limited options."
      }
    },
    {
      "src": "https://framerusercontent.com/images/TjogbuTDVPzpI3UuHe4Ztdl3fE.png",
      "alt": "",
      "filename": "blog/get-more-time-3.png",
      "context": {
        "before": "Next, thinking about what to eat for breakfast can easily consume 5-15 minutes of my time each day. I know myself well enough that I care more about the nutrition of my food than the excitement of trying new food for breakfast. Hence, I'm sticking to my usuals such as sweet potato, banana, boiled eggs, toast, avocado, muesli, and yogurt. I have all this stock, and every day I just grab what I feel like from the limited options. Up until 8:45 am, I still make no decision, wasting no time. Next: dress up I've long stopped caring about what I wear, maybe because most of my work is in front of a computer. I have about 12 Uniqlo t-shirts in plain colors, 7-8 J Crew shirts in plain colors, and 4-5 American Eagle jeans in black or blue. Every day, I just put on whatever combination that I feel like on the day. Not having to decide what to wear saves me a good 5-15 mins.",
        "after": "Plain is the new cool. Work time It is time to put in productive work so I can make a living to sustain my family. There are so many productivity tactics when it comes to working, and I am going to share my top 3. ‍ 1) Task batching Do things in batches for top efficiency. Imagine yourself in a factory. ‍ Task switching is one of the best things to do if you want to waste time. When you move between writing articles to engaging your audiences on Twitter, somehow you'll always do something else in transition. This is why there is a popular term called Task Batching to tackle this."
      }
    },
    {
      "src": "https://framerusercontent.com/images/CSDOkBVEZijkdYJ17Fii5z23mY.jpeg",
      "alt": "",
      "filename": "blog/get-more-time-4.png",
      "context": {
        "before": "I've long stopped caring about what I wear, maybe because most of my work is in front of a computer. I have about 12 Uniqlo t-shirts in plain colors, 7-8 J Crew shirts in plain colors, and 4-5 American Eagle jeans in black or blue. Every day, I just put on whatever combination that I feel like on the day. Not having to decide what to wear saves me a good 5-15 mins. Plain is the new cool. Work time It is time to put in productive work so I can make a living to sustain my family. There are so many productivity tactics when it comes to working, and I am going to share my top 3. ‍ 1) Task batching",
        "after": "Do things in batches for top efficiency. Imagine yourself in a factory. ‍ Task switching is one of the best things to do if you want to waste time. When you move between writing articles to engaging your audiences on Twitter, somehow you'll always do something else in transition. This is why there is a popular term called Task Batching to tackle this. Let's take my writing as an example. When I first started, I would schedule time of my week to do 1) outlining, 2) writing, 3) finalizing, and 4) publishing. I do one article at a time, each task might take me 30-180 minutes at different times of the week."
      }
    },
    {
      "src": "https://framerusercontent.com/images/5fMDEZ3vT32VPcsZ0HrQbvlztQ.png",
      "alt": "",
      "filename": "blog/get-more-time-5.png",
      "context": {
        "before": "Let's take my writing as an example. When I first started, I would schedule time of my week to do 1) outlining, 2) writing, 3) finalizing, and 4) publishing. I do one article at a time, each task might take me 30-180 minutes at different times of the week. Soon after I discovered Task Batching, now I'm spending 90-270 minutes blocks of time and I'm doing 2-3 articles in one block. It means I'm outlining 3 articles together, and I'm writing 3 articles in one morning. The benefits of this are clear. When you're in the zone of doing one thing, you're laser-focused and you eliminate making decisions and transitioning. Less time wasted. ‍ 2) Automating to eliminate distraction",
        "after": "Use \"+\" in your email in order to set up auto-filter. The \"+newsletter\" part won't affect the email functionality. ‍ Newsletters have been such a big part of how I consume interesting knowledge these days, and I subscribe to quite a number of them. If I let these newsletters flow into my inbox freely, I'm setting myself up for failure because I'll have to clear my inbox very frequently. What I do is I subscribe using this unique email kevon.cheung+newsletter@gmail.com, and in my Gmail, I set up a filter so that any email sent to this address will automatically go into my Newsletter folder. And I block out 2 times a week to read them quickly. Again, getting into my reading zone for an hour allows me to consume better than reading one or two newsletters here and there."
      }
    }
  ]
}