{
  "images": [
    {
      "src": "https://framerusercontent.com/images/aTSF4FrP8kSTjX1RBvr5AiLSo.png",
      "alt": "",
      "filename": "blog/goal-setting-1.png",
      "context": {
        "before": "This approach helped me hit my fitness goal in 14 days life Lessons December 8, 2020",
        "after": "In the last 9 months during COVID-19, I was insanely unhealthy. Before then, I had been exercising regularly through my routine of running and cycling. And I enjoyed getting out for both fresh air and sweat. But ever since COVID-19 became a pandemic, and our team moved to work from home, then my wife became pregnant, suddenly I found myself spending the majority of my time at home. I was running an investor-backed startup called Toasty as the CEO, and there was tremendous pressure on me to make it work. “Giving the best I can” was my mantra at that time, which meant sacrificing other things in order to give everything I had to Toasty."
      }
    },
    {
      "src": "https://framerusercontent.com/images/22kP5kVU6Dtiax1LZdp1mXNZ8vI.png",
      "alt": "",
      "filename": "blog/goal-setting-2.png",
      "context": {
        "before": "How did a 14-day challenge turn into a 6-week thing and it is still going on in my life right now? What were the key ingredients or secret formulas that made it relatively easy to achieve my goal? What was different about this challenge vs. my previous set goals? The Sweat Let’s take a look at what I did in the last 6 weeks compared to the first 9 months of 2020. This is my running calendar on Strava. From Jan to Sep, on average I ran less than 2 hours a month, and I rarely did any exercise other than running.",
        "after": "Starting from mid-October, I’ve boosted up to at least 10-13 hours of running in a month. I also started following some YouTube videos for 20 minutes of HIIT, I did it on average 4-5 times a week. This meant for at least half the week, I ran and did HIIT on the same day! Eating-wise, I ordered calorie-controlled meal plans so that I could burn more than I took in each day. Most importantly, I put up a piece of paper and recorded my weight and waist every morning. I forgot to do so on some days. And as you can see, I was drunk one day (lol) so I didn’t manage to exercise."
      }
    },
    {
      "src": "https://framerusercontent.com/images/aTSF4FrP8kSTjX1RBvr5AiLSo.png",
      "alt": "",
      "filename": "blog/goal-setting-3.png",
      "context": {
        "before": "This approach helped me hit my fitness goal in 14 days life Lessons December 8, 2020",
        "after": "In the last 9 months during COVID-19, I was insanely unhealthy. Before then, I had been exercising regularly through my routine of running and cycling. And I enjoyed getting out for both fresh air and sweat. But ever since COVID-19 became a pandemic, and our team moved to work from home, then my wife became pregnant, suddenly I found myself spending the majority of my time at home. I was running an investor-backed startup called Toasty as the CEO, and there was tremendous pressure on me to make it work. “Giving the best I can” was my mantra at that time, which meant sacrificing other things in order to give everything I had to Toasty."
      }
    },
    {
      "src": "https://framerusercontent.com/images/ekRWE78TFrO3hZU1f9FIHXMGY.jpeg",
      "alt": "",
      "filename": "blog/goal-setting-4.png",
      "context": {
        "before": "Starting from mid-October, I’ve boosted up to at least 10-13 hours of running in a month. I also started following some YouTube videos for 20 minutes of HIIT, I did it on average 4-5 times a week. This meant for at least half the week, I ran and did HIIT on the same day! Eating-wise, I ordered calorie-controlled meal plans so that I could burn more than I took in each day. Most importantly, I put up a piece of paper and recorded my weight and waist every morning. I forgot to do so on some days. And as you can see, I was drunk one day (lol) so I didn’t manage to exercise.",
        "after": "Why did it work? The 5 magical ingredients. 1. I gave myself an achievable timeframe 14 days is a great length to push for change. It is long enough to develop habits and routines, yet it is short enough for me to see the finish line. It is important for me to know that there is an end to this. 2. I wasn’t thinking about my end goal My end goal was to lose my big belly. But to focus on that wasn’t going to get me there, so I didn’t think about it at all. Instead, every day I woke up, I was thinking about going for a run, doing a 20-min HIIT, and what I was going to eat. These things were top of my mind, not my end goal which was out of my control."
      }
    },
    {
      "src": "https://framerusercontent.com/images/d9PTZQz2lgLJbDheFCP4hkhCNcI.png",
      "alt": "",
      "filename": "blog/goal-setting-5.png",
      "context": {
        "before": "I wouldn’t overwhelm myself with too many short-term goals at the same time, because I think it is just impossible to have so many “top of minds”. To me, combining career goals, fitness goals, family goals, and mental goals, having 4 at the same time is the limit. Of course, as we practice, we might be able to increase that number. And why did goal setting fail for me previously? I’ve set many goals for myself in my life. Some I achieved, and some I failed. I used to love putting up my New Year solutions on my blog, so let’s take a look at what I set in the past years.",
        "after": "These are my goals for 2019, and looking back, they’re large and vague goals, they’re things I couldn’t control. And you bet it, it was out of my mind after about a week into 2019. Going forward, I will abandon the whole concept of New Year's resolutions. Instead, I will give myself loads of 14-day challenges in different areas of my life, achieve them, and celebrate small wins. You can get an easy start now The challenge for you right now is that you understand you have to guide your mind when you set new goals but to apply a model like this seems like a lot of work, and you don’t know where to start."
      }
    },
    {
      "src": "https://framerusercontent.com/images/8Jv0HPLDr0K4ju3pIQldOi40k.png",
      "alt": "",
      "filename": "blog/goal-setting-6.png",
      "context": {
        "before": "The challenge for you right now is that you understand you have to guide your mind when you set new goals but to apply a model like this seems like a lot of work, and you don’t know where to start. Just like starting anything new, I recommend starting small and then celebrating it soon. The goal here is to have a successful story about achieving a goal in 14 days. Once you get there, then you’ll naturally expand in your own ways. To get you started, I have this framework set up so you can clone the Google Sheet for free here .",
        "after": "Download: Click Here Fill this in, and get started today. I can guarantee you that something good is going to come out after these 14 days. If you would like a second pair of eyes to look through what you have noted down, I’d be happy to review and give you some feedback. Just hit me up on this Twitter thread and we can connect and chat! Join me on my journey The best way is to subscribe to my newsletter. Subscribe Here © Kevon Cheung 2024 X Threads Instagram YouTube (()=>{function u(){function n(t,e,i){let r=document.createElement(\"a\");r.href=t,r.target=i,r.rel=e,document.body.appendChild(r),r.click(),r.remove()}function o(t){if(this.dataset.hydrated){this.removeEventListener(\"click\",o);return}t.preventDefault(),t.stopPropagation();let e=this.getAttribute(\"href\");if(!e)return;if(/Mac|iPod|iPhone|iPad/u.test(navigator.userAgent)?t.metaKey:t.ctrlKey)return n(e,\"\",\"_blank\");let r=this.getAttribute(\"rel\")??\"\",c=this.getAttribute(\"target\")??\"\";n(e,r,c)}function a(t){if(this.dataset.hydrated){this.removeEventListener(\"auxclick\",o);return}t.preventDefault(),t.stopPropagation();let e=this.getAttribute(\"href\");e&&n(e,\"\",\"_blank\")}function s(t){if(this.dataset.hydrated){this.removeEventListener(\"keydown\",s);return}if(t.key!==\"Enter\")return;t.preventDefault(),t.stopPropagation();let e=this.getAttribute(\"href\");if(!e)return;let i=this.getAttribute(\"rel\")??\"\",r=this.getAttribute(\"target\")??\"\";n(e,i,r)}document.querySelectorAll(\"[data-nested-link]\").forEach(t=>{t instanceof HTMLElement&&(t.addEventListener(\"click\",o),t.addEventListener(\"auxclick\",a),t.addEventListener(\"keydown\",s))})}return u})()()"
      }
    }
  ]
}