{
  "images": [
    {
      "src": "https://framerusercontent.com/images/5flpGlHjVET5tAZbstKUBCB2Rg.jpeg",
      "alt": "",
      "filename": "blog/growing-twitter-audience-1.png",
      "context": {
        "before": "How I grew my Twitter audience with human psychology marketing January 30, 2021",
        "after": "If you are new on Twitter and want to know how to grow to 500 followers with the right approach in 10 weeks, this article is for you. I remember I was doing a sharing session on my Building in Public Definitive Guide and the host asked me, \"Kevon, I see that you have a very cozy audience on Twitter. How did you start?\" \"It was a lot of hard work! But mostly I think doing the right things helped the most.\" That's what I said. And I could tell the participants really enjoyed the tips I shared, so this article is my way of helping more people get started."
      }
    },
    {
      "src": "https://framerusercontent.com/images/c07RqAMF0AxpocGvQHCu1LY0C94.png",
      "alt": "",
      "filename": "blog/growing-twitter-audience-2.png",
      "context": {
        "before": "I remember I was doing a sharing session on my Building in Public Definitive Guide and the host asked me, \"Kevon, I see that you have a very cozy audience on Twitter. How did you start?\" \"It was a lot of hard work! But mostly I think doing the right things helped the most.\" That's what I said. And I could tell the participants really enjoyed the tips I shared, so this article is my way of helping more people get started. As of Feb 2022, my presence has grown to 9,000+ followers . One year ago when I wrote this article, I had 553 followers after using Twitter for 10 weeks. which makes this sharing relevant to where you are now.",
        "after": "Once you have 500 followers, you can grow it organically. Starting out ‍ My Twitter account was created in 2009 but I barely used it in the last 11 years. I had about 100 people I was following but most of them were not active. I also had about 184 followers who were mainly friends. My main goal was 1) to find the quickest way to get to 500 followers and 2) to be active in tweeting and engaging with a tight circle. I knew that only when I achieved these two goals would people perceive me as a \"real\" person and want to interact with me."
      }
    }
  ]
}