{
  "images": [
    {
      "src": "https://framerusercontent.com/images/X2MEL8ijjR1D4uBSEGquUAXNV8.png",
      "alt": "",
      "filename": "blog/landing-page-contra-1.png",
      "context": {
        "before": "Landing page optimization: Contra.com marketing January 15, 2021",
        "after": "What does the future of work look like? Flexible, do what you love, and be measured by outcome, not hours. I have never been a victim of the traditional 9-6 job. As mentioned here , I am selective to find companies and teams that I know I'd enjoy working there so much that I put in 300% effort. Ever since COVID-19 happened and my last team moved to a fully remote environment, I've imagined what working will look like in the near future. It is going to be more decentralized (the next level of the gig economy), with individuals not just executing freelance projects for employers, but also building sustainable, paid products that can support their lives. This is already happening, and I documented some examples in my"
      }
    },
    {
      "src": "https://framerusercontent.com/images/bXtz4b3sOSEalKTHokI9zzeZXE.png",
      "alt": "",
      "filename": "blog/landing-page-contra-2.png",
      "context": {
        "before": "I was impressed by their vision and community, so I browsed some more and saw that they were looking for ambassadors. I clicked in, motivated by my curiosity, and saw an application form with the question \"How would you change/improve our current landing pages?\" I wanted to apply and connect with these awesome people!, so I did. And this post is my answer to the question they posted. An exercise: visit this homepage I want to take you through the entire thought process. You'll take a look at their homepage just like any new visitor. Click below and read the entire page. Click here to enlarge this image below:",
        "after": "What I love Branding is strong. Contra shows a lot of character and personality, and I want to learn more about the futuristic concept of this platform. The site uses a lot of human faces which is great for any website, but particularly a people-oriented product. The site doesn't overwhelm a new visitor. CTA is very clear: they have an exclusive platform and whoever wants to get in must get an invite. For people who want more info, they have a detailed FAQ page. My first visitor experience Now, you and I have both visited the website. We have a first impression of what Contra is about. Next, I am going to share what I was thinking when I visited the first time."
      }
    }
  ]
}