{
  "images": [
    {
      "src": "https://framerusercontent.com/images/n7rEDLK6sUGaggkiLvH8Lyylgcs.png",
      "alt": "",
      "filename": "blog/lessons-at-30-1.png",
      "context": {
        "before": "8 lessons as I turned 30 life Lessons December 29, 2020",
        "after": "2020 was a big year. We will all remember it as a year we got hit by a worldwide pandemic that was the deadliest in the last century, after the 1918 influenza pandemic. In one single year, so much about how we live in this world was changed. It was also a big year because I turned 30 years old. There are a lot of sayings about how the 20s are for exploring and the 30s are for going full speed, so this year seemed to be a year in which I should have everything figured out. Haven't I? Let's quickly sum up my latest life:"
      }
    },
    {
      "src": "https://framerusercontent.com/images/NrmiJJ8Rtm8tIby5nQaRyh2549M.jpg",
      "alt": "",
      "filename": "blog/lessons-at-30-2.png",
      "context": {
        "before": "The list doesn't look crazy at all because I have never been the type of person that has a lot going on at the same time. I much prefer a simple life, so I can concentrate on the few things that matter most to me. With me stepping down from the CEO role at Toasty in Oct 2020, I was able to spend some time with myself as I don't have to manage a team, do a crazy amount of calls, and put my head down to grow the company. It was a period where I could step back and reflect. And it became clear that I learned some good lessons in my first 30 years on this planet. Raising a family",
        "after": "Our magical wedding in 2019 To many, getting married and raising a few kids is still the standard belief of living a fulfilled life. On the flip side, more and more people are enjoying a single or kidless life as the world becomes a more competitive place to live in. My own philosophy has always been - make a plan, but expect it to change. When I was first out of university, I moved to Singapore, a country where I only knew 2 people. I was enjoying my overseas, independent life, meeting new friends, going to music festivals, and doing whatever I wanted. I told myself that life was so good that my plan would be to settle down at 35 years old."
      }
    },
    {
      "src": "https://framerusercontent.com/images/agHSdDvPJzayPbrybuBbyMxZng4.jpg",
      "alt": "",
      "filename": "blog/lessons-at-30-3.png",
      "context": {
        "before": "Just like everything else, my belief is that overthinking relationships and marriage can only hurt you. I am starting to enjoy the serendipity life gives us. If a boy or girl shows up in your life, and you see the potential of spending a lot of time (years) with this person, go for it. Too many people have a list of checkboxes to decide whether he or she is the one, my advice is to just follow your heart. As to having kids or not having kids - I don't have a recommendation for most couples. If you enjoy the presence of having children around and you can see that the whole idea makes a richer life, do it. If you have a headache thinking about kids, then don't. The main idea here is never to delay making decisions by overthinking or overanalyzing. Go with the flow. Investor-backed startups",
        "after": "Toasty team hustling Let's just say - it wasn't easy. Starting a company is hard enough . From building the product to selling it, to managing a team, to executing the vision, every single bit requires a lot of attention from the founders. But, to have to work with a group of investors who put money betting on you, it is a whole different level. The good side is definitely to be able to hire a team and do more in a short period of time. Investors can also give you accountability, a supporting network, and leverage to scale the company quickly."
      }
    },
    {
      "src": "https://framerusercontent.com/images/oAZfS4EOfMBmfN8wsbc6ZyyEVo.jpg",
      "alt": "",
      "filename": "blog/lessons-at-30-4.png",
      "context": {
        "before": "On the other hand, some investors, since they fund you, want to get involved by offering their comments and advice. This not only takes away your time in running the business, but you'll also find the comments to be only partially relevant. After all, they're not on the ground executing, and they're not the end users. After 18 months of running Toasty, I get to understand my own style a little better. Maybe I am a better fit to kick off a company in a bootstrapped way (self-funded, no investors). This allows me to focus on building the product initially, instead of fundraising and managing investor relations, and also to grow the business sustainably, instead of chasing after certain metrics. Taking time off",
        "after": "Every time I take time off, I pick up new things like cycling or making videos So far, I've taken 2 major breaks in my career. 1 in late 2018 after I left First Code Academy to pursue my passion in software, and 1 in late 2020 after I stepped down from Toasty. In 2018, I decided to use the transition time to create a YouTube channel and made 6 lifestyle videos on the topic of relationships and raising kids. I wanted some time off from management to do creative work. Then after 2 months, I hopped back into the tech world joining a startup."
      }
    },
    {
      "src": "https://framerusercontent.com/images/RfZsfeQiL68Te3J20jD6EPTaX1w.jpeg",
      "alt": "",
      "filename": "blog/lessons-at-30-5.png",
      "context": {
        "before": "My biggest realization was that \"taking time off\" has always been seen as a negative thing by many people. \"Not working\" is perceived as lazy, slacking off, and having no goals in life. And that's because, in fact, there are a lot of people who are directionless and they let it get in the way of their lives. But for me, taking time off this time was extremely rewarding. I learned a ton about myself, my passion, and who I want to be at least for the next 5 years. And all these guide me to figure out my next step - which is likely to join an amazing team to create a beautiful tech product and to create micro software projects on the side. Diversify my experience",
        "after": "I enjoy heading out and finding new paths I always put 300% into whatever I was focusing on at the moment, and that's why I was eventually invited to become a co-founder at First Code Academy back in 2017. For all the companies I worked for, I treated them like my own businesses. Why 300%? Because we all have 3 chunks of 8 hours a day. Most people are doing a job that is 8 hours long, but you'd find me pouring my heart out day and night. I was doing everything from new city expansion to website development, to designing our brochure, to managing operations and admin, etc. Thinking back, it was crazy but super good times."
      }
    },
    {
      "src": "https://framerusercontent.com/images/TUW2UORHjOaqMfkQRPmwuIyQ.jpg",
      "alt": "",
      "filename": "blog/lessons-at-30-6.png",
      "context": {
        "before": "Working extra hard was the right move early in my career because I wanted to accelerate my learning. But what I set aside were things like writing, following the stocks I invested in, and learning things outside my box. After the initial stage of my career, I have now learned to diversify my experience: build up my own brand, create an area of expertise, and learn how to invest (and actually follow the stocks). This is my life after all, and I'm the only person responsible for it. To those reading this: this is not to say you shouldn't work hard at your job, you definitely should. How many hours are there in one day? Never tell someone you don't have enough time. Time is essential",
        "after": "The most valuable thing: time If there is one thing that COVID-19 taught me, it is the value of time and how to maximize it. No more commuting to the office - 1.5 hours saved each day. No more having lunch with colleagues - 1 hour saved each day. A lot of activities are canceled - lots of hours saved. With so much time at home, I started to think about how I could best utilize them to live a productive life . The commute and lunch alone gave me 2.5 extra hours each day that could be used towards exercising, starting projects, reading, writing (which btw you can subscribe to my newsletter at the bottom of this post), and spending time with my family. Unbelievable."
      }
    },
    {
      "src": "https://framerusercontent.com/images/XYfYBmEaOsHGaDHlpPdrPijDTg.png",
      "alt": "",
      "filename": "blog/lessons-at-30-7.png",
      "context": {
        "before": "With so much time at home, I started to think about how I could best utilize them to live a productive life . The commute and lunch alone gave me 2.5 extra hours each day that could be used towards exercising, starting projects, reading, writing (which btw you can subscribe to my newsletter at the bottom of this post), and spending time with my family. Unbelievable. This is also the main reason why I'm an advocate for remote working. It allows everyone to get the best out of the life they want to live. Invest for the long-term",
        "after": "Everyone is encouraged to explore new ways of generating income in addition to a salary I've been investing in stocks since young, mainly because my mother gave me US$10k to explore this topic. And I went on to become one of the portfolio managers managing part of the school endowment fund at my university. I'm a fan of value investing - Buffett and Munger style. So I prefer to invest in the long-term and not have to look at it every single day. I want my days to be spent on creating value, software, and businesses."
      }
    },
    {
      "src": "https://framerusercontent.com/images/1ComafWpyuYKmLNIRfBELz1LzcA.jpg",
      "alt": "",
      "filename": "blog/lessons-at-30-8.png",
      "context": {
        "before": "The biggest mistake I made was buying stocks and then not looking at them at all. Some would argue that's the right thing to do for long-term investing, but the counter-argument is that you should still at least keep an eye on them. What happened to me was that some of my stocks dropped 50% and I didn't react to the drop fast enough. How many years would it take for these stocks to come back to my purchase price? A long time. On a side note, until today, I'm still fascinated by people who have zero interest in investing. They seem to really enjoy using their time to trade in for money, instead of their capital. Active income (money you earn from working the hours) can support daily lives, but most wealth is made from investing in assets. Find my own tribe",
        "after": "Indie Hackers love building and creating value for the world I'm based in Hong Kong currently, and that's because it is where my family lives. I've always debated whether this is the city I want to live in because if you look closely enough at me, you'll notice that everything I read, follow, and advocate for has nothing to do with Hong Kong. I was having a hard time finding a like-minded tribe locally, so I started looking online. There are a lot of people that I look up to and want to interact with from everywhere, hence these days I'm spending more time meeting new friends via the Internet at places like Twitter and Indie Hacker."
      }
    },
    {
      "src": "https://framerusercontent.com/images/e7YXLxyBAgXczZ9MmStcUwl2yk.jpg",
      "alt": "",
      "filename": "blog/lessons-at-30-9.png",
      "context": {
        "before": "I'm based in Hong Kong currently, and that's because it is where my family lives. I've always debated whether this is the city I want to live in because if you look closely enough at me, you'll notice that everything I read, follow, and advocate for has nothing to do with Hong Kong. I was having a hard time finding a like-minded tribe locally, so I started looking online. There are a lot of people that I look up to and want to interact with from everywhere, hence these days I'm spending more time meeting new friends via the Internet at places like Twitter and Indie Hacker. Will I ever move away from Hong Kong with my family? Possibly! For now, I'm relying on the Internet to connect the dots. Thinking",
        "after": "Your age is proportional to the percentage of time you spend \"thinking\" These days, you'd find me looking out the window and staring at the sky or trees often. That's when I'm thinking about ideas or processing a new piece of knowledge I just acquired. To many people, it looks like I am daydreaming or not being productive. And that's exactly my belief in productivity for most of my life - that execution is productive and non-execution is a waste of time. Writing articles, boosting our website's ranking through SEO , finding bugs in our product, and writing training guides for the team - these are all productive. I was putting in lots of hours, from 7 am to 11 pm, when I ran Toasty."
      }
    }
  ]
}