{
  "images": [
    {
      "src": "https://framerusercontent.com/images/WhvmP8TCieUML9dAbbwulF0U8.jpeg",
      "alt": "",
      "filename": "blog/oct-nov-2021-1.png",
      "context": {
        "before": "October & November 2021 Retrospective & Income Report review November 30, 2021",
        "after": "You might notice that I combined October and November in this report, and that's because I was busy designing the learning experiences for my new cohort of Build in Public Mastery . While I'm a fan of consistency, I'm a bigger fan of weighing top priorities. Since I didn't have much to share in October, why not combine it with November, right? These last 2 months were life-changing for me. I became more confident. I got clarity on where I wanted to head toward next year. And most importantly, I achieved $10,000 in online revenue as a creator"
      }
    },
    {
      "src": "https://framerusercontent.com/images/NMCF9Xv3S5UuKaM1fytJER61cV0.jpeg",
      "alt": "",
      "filename": "blog/oct-nov-2021-2.png",
      "context": {
        "before": "You might notice that I combined October and November in this report, and that's because I was busy designing the learning experiences for my new cohort of Build in Public Mastery . While I'm a fan of consistency, I'm a bigger fan of weighing top priorities. Since I didn't have much to share in October, why not combine it with November, right? These last 2 months were life-changing for me. I became more confident. I got clarity on where I wanted to head toward next year. And most importantly, I achieved $10,000 in online revenue as a creator after refocusing myself from Aug to Oct.",
        "after": "How is my personal life? I absolutely love the balance I have in life right now. Work is enjoyable. I had a video call with an old friend from my university days and he said \"Wow you look so happy. You must love what you're doing now!\" That's for sure. Numbers are still small, but I'm truly loving it. The satisfaction I get from running my own online business and empowering other entrepreneurs is remarkable. I finally feel that things are moving forward. And it is not about pouring more hours into it, but more about working on the right things. If I can spend the same hours in 2022 and 3x-4x my numbers, I'd be in joy."
      }
    },
    {
      "src": "https://framerusercontent.com/images/fcqpcHL6fLIYF9CpsAuIsvPXnI.jpeg",
      "alt": "",
      "filename": "blog/oct-nov-2021-3.png",
      "context": {
        "before": "Again, just like most of us, it is impostor syndrome and a lack of confidence kicking in. When I look back to the last 13 months of this journey, I wasn't fully confident in the first 10 months. I was still new to the topics I was writing and sharing about. I was finding out the best way to teach. Only now I'm able to say I am very confident about this topic and how I design the learning experience. As you read above, I now charge $500+ for my 3-week cohort-based course and I know it is totally worth this price point if not more.",
        "after": "How did I arrive at this mental state today? I see a few triggers: I talk and share about this topic long enough that it becomes a part of me. I know the topic inside out so I can share it anytime, anywhere. I'm also happy to be associated with this term and see myself focusing on it for many years to come. Building in Public is no longer just a trend that people talk about. I develop a unique framework to guide my students . Having this framework also boosts my confidence. I get a lot of public recognition and encouragement to keep my motivation high. And this is also attributed to the fact that I'm building my business in public."
      }
    },
    {
      "src": "https://framerusercontent.com/images/Saa1QuRTVoS32jUHOqgUzlsQnE.jpeg",
      "alt": "",
      "filename": "blog/oct-nov-2021-4.png",
      "context": {
        "before": "I talk and share about this topic long enough that it becomes a part of me. I know the topic inside out so I can share it anytime, anywhere. I'm also happy to be associated with this term and see myself focusing on it for many years to come. Building in Public is no longer just a trend that people talk about. I develop a unique framework to guide my students . Having this framework also boosts my confidence. I get a lot of public recognition and encouragement to keep my motivation high. And this is also attributed to the fact that I'm building my business in public.",
        "after": "For anyone having difficulties with self-confidence, these 3 things can certainly help. Where did the students come from? This is a super intriguing data point I want to dig into. For these students who are happy to pay this new price point, what attracts them? Out of my 7 students enrolled in Build in Public Mastery <BIPM2>, 3 students come from knowing Kevon's work in communities , e.g. Maven and a local circle of friends 4 students come from taking my free email course and getting newsletters for a long time (3-6 months long) and they open every single email I've sent them"
      }
    },
    {
      "src": "https://framerusercontent.com/images/eY7ofkin7KqFwiqdRHFHrRQ60.jpeg",
      "alt": "",
      "filename": "blog/oct-nov-2021-5.png",
      "context": {
        "before": "For anyone having difficulties with self-confidence, these 3 things can certainly help. Where did the students come from? This is a super intriguing data point I want to dig into. For these students who are happy to pay this new price point, what attracts them? Out of my 7 students enrolled in Build in Public Mastery <BIPM2>, 3 students come from knowing Kevon's work in communities , e.g. Maven and a local circle of friends 4 students come from taking my free email course and getting newsletters for a long time (3-6 months long) and they open every single email I've sent them",
        "after": "What is this telling me? How can I learn from these data points? It is important to show up in communities and share my work so people get to know Kevon + Building in Public. It is not about selling them seats, but more about sharing what I know and letting them know that I'm here if they need help in this area Free email courses and regular content are such important tools to build trust over time . No one is going to sign up for a $500+ course after seeing Kevon's tweets for the 1st time. Trust is built over months. Developing a regular schedule of content and bringing more people into these free resources seems like a good next step."
      }
    },
    {
      "src": "https://framerusercontent.com/images/JD3sOVzgHYnsEK5W7Bry81qo0D0.png",
      "alt": "",
      "filename": "blog/oct-nov-2021-6.png",
      "context": {
        "before": "For me, only 50% of my accepted students ended up enrolling. Priorities change. \"Just filling in the form first\". Life gets in the way. These are all reasons that they cannot enroll at the end. But don't worry. Running a successful cohort-based course, I believe, is about doing it for a long time. People need to know the course exists and then plan ahead their money & time. You shouldn't see it as a quick develop-sell-run cycle because you'll definitely be disappointed. I also shared a few other learnings in this tweet:",
        "after": "Plan for December I'm going to focus 100% on Build in Public Mastery Cohort <BIPM2>, and then I'll take the last 2 weeks of December off to do a few things: Read 1-2 fiction to refresh myself Do an annual review of 2021 and plan ahead for 2022 (I believe it is a big year for me) Schedule a few review calls with great friends who are on the same journey Spend time with family! Join me on my journey The best way is to subscribe to my newsletter. Subscribe Here © Kevon Cheung 2024 X Threads Instagram YouTube"
      }
    },
    {
      "src": "https://framerusercontent.com/images/fxvMS47Q8Hpnl39uUjH6M4x7H44.png",
      "alt": "",
      "filename": "blog/oct-nov-2021-7.png",
      "context": {
        "before": "People need to know the course exists and then plan ahead their money & time. You shouldn't see it as a quick develop-sell-run cycle because you'll definitely be disappointed. I also shared a few other learnings in this tweet: Plan for December I'm going to focus 100% on Build in Public Mastery Cohort <BIPM2>, and then I'll take the last 2 weeks of December off to do a few things: Read 1-2 fiction to refresh myself Do an annual review of 2021 and plan ahead for 2022 (I believe it is a big year for me) Schedule a few review calls with great friends who are on the same journey Spend time with family!",
        "after": "Join me on my journey The best way is to subscribe to my newsletter. Subscribe Here © Kevon Cheung 2024 X Threads Instagram YouTube (()=>{function u(){function n(t,e,i){let r=document.createElement(\"a\");r.href=t,r.target=i,r.rel=e,document.body.appendChild(r),r.click(),r.remove()}function o(t){if(this.dataset.hydrated){this.removeEventListener(\"click\",o);return}t.preventDefault(),t.stopPropagation();let e=this.getAttribute(\"href\");if(!e)return;if(/Mac|iPod|iPhone|iPad/u.test(navigator.userAgent)?t.metaKey:t.ctrlKey)return n(e,\"\",\"_blank\");let r=this.getAttribute(\"rel\")??\"\",c=this.getAttribute(\"target\")??\"\";n(e,r,c)}function a(t){if(this.dataset.hydrated){this.removeEventListener(\"auxclick\",o);return}t.preventDefault(),t.stopPropagation();let e=this.getAttribute(\"href\");e&&n(e,\"\",\"_blank\")}function s(t){if(this.dataset.hydrated){this.removeEventListener(\"keydown\",s);return}if(t.key!==\"Enter\")return;t.preventDefault(),t.stopPropagation();let e=this.getAttribute(\"href\");if(!e)return;let i=this.getAttribute(\"rel\")??\"\",r=this.getAttribute(\"target\")??\"\";n(e,i,r)}document.querySelectorAll(\"[data-nested-link]\").forEach(t=>{t instanceof HTMLElement&&(t.addEventListener(\"click\",o),t.addEventListener(\"auxclick\",a),t.addEventListener(\"keydown\",s))})}return u})()()"
      }
    }
  ]
}