{
  "images": [
    {
      "src": "https://framerusercontent.com/images/qCN4K08DMKB7jxM54kipNQS8hmM.jpeg",
      "alt": "",
      "filename": "blog/sep-2021-1.png",
      "context": {
        "before": "September 2021 Retrospective & Income Report review October 11, 2021",
        "after": "Last month I talked about how I'm going to build products that can get better over time. I've gotten more clarity over this month. And I feel like this kid who finally settles for 1 or 2 toys. To kick off this month's report, I want to take a moment to say this. Being a solopreneur is hard. Being an online solopreneur is VERY hard. You don't get to meet people in real life. A lot of your work is writing content, building products, and automating workflows. It can be quite a lonely path. But I think I've found my thing."
      }
    },
    {
      "src": "https://framerusercontent.com/images/veYdR2y8ZYqhDkazv9Xcr9AyE.png",
      "alt": "",
      "filename": "blog/sep-2021-2.png",
      "context": {
        "before": "September 2021 Retrospective & Income Report review October 11, 2021 Last month I talked about how I'm going to build products that can get better over time. I've gotten more clarity over this month. And I feel like this kid who finally settles for 1 or 2 toys. To kick off this month's report, I want to take a moment to say this.",
        "after": "Being a solopreneur is hard. Being an online solopreneur is VERY hard. You don't get to meet people in real life. A lot of your work is writing content, building products, and automating workflows. It can be quite a lonely path. But I think I've found my thing. This lifestyle fits perfectly with who I have been since I was a teenager - I enjoy a quiet environment where I can do deep work, build things to serve many people online, and most importantly, do things different from the real-life people around me."
      }
    },
    {
      "src": "https://framerusercontent.com/images/uxFxDHVfMeOr45O8HDncPglS2w.png",
      "alt": "",
      "filename": "blog/sep-2021-3.png",
      "context": {
        "before": "Stripe: $5.36, Outseta: $29, Gumroad: $5.4 Webflow: $40 (2 domains), Hypefury: $19, ConvertKit: $19.95 (downgrading so using credits), Zoom: $14.99, Descript: $15, Gmail $6, Xero $20, Potion $10, Phone Bill $20, Namecheap $9.66 Community: $42 (quarterly membership) I don't have a lot to share about my expenses. As I canceled Circle ($79) and downgraded ConvertKit ($79→$39), I'm cutting down my expenses which is always great when revenue isn't up to par yet. What important things happened How I hustled to $2K/mo and got rid of it",
        "after": "For details, read this blog post . But here I will give you a TL;DR version. Basically, I'm letting go of my 2 main revenue streams. I paused the 30DaysInPublic course as I'm currently leveling up my skills in course design and teaching. I aim to build a course I can run 3-4 times a year and keep making it better for each cohort. I'm no longer charging a recurring membership fee for my Public Lab community. The decision comes from my shift of focus to be more course-driven. I want the community to be a supporting component instead of its own standalone product that charges members for a space to hang out."
      }
    },
    {
      "src": "https://framerusercontent.com/images/ce9C4hGcbMKm1bHcCYLFS9ZgI.jpeg",
      "alt": "",
      "filename": "blog/sep-2021-4.png",
      "context": {
        "before": "I paused the 30DaysInPublic course as I'm currently leveling up my skills in course design and teaching. I aim to build a course I can run 3-4 times a year and keep making it better for each cohort. I'm no longer charging a recurring membership fee for my Public Lab community. The decision comes from my shift of focus to be more course-driven. I want the community to be a supporting component instead of its own standalone product that charges members for a space to hang out. I'm a believer that getting rid of things that are not working well is a way to keep myself working towards the right direction. I'm a course instructor at Maven",
        "after": "I'm one of the instructors at Maven Course Accelerator Cohort 3 Have you heard of cohort-based courses? It is currently revolutionizing online education. The key difference is that students get to start and end at the same time, so it is focused on community-driven learning with accountability. After running a few cohort-based courses in the last few months, I wanted to skill up before I created my 2nd iteration of a Building in Public course. Now that I'm 1 of the 145 instructors out of 2,000 applicants at the Maven Course Accelerator."
      }
    },
    {
      "src": "https://framerusercontent.com/images/qNt6ykAWE68lkuZrkWPo6d4W4.jpeg",
      "alt": "",
      "filename": "blog/sep-2021-5.png",
      "context": {
        "before": "A course is not just slapping together a few videos for people to watch. A lot has to go into curriculum design and lesson design. I'm very happy about how this 2nd iteration is shaping up! Stay tuned! Creating Showing Up Right in Public A cohort-based course usually comes with premium pricing because it is extremely resource-intensive. As a course creator, I could be spending my entire month running the course. So it is important to also work on products that people can consume on a self-paced basis. If you've taken a look at Public Lab's homepage , you'll know that I'm focused on helping other entrepreneurs and creators get through these 5 stages.",
        "after": "While the Building in Public cohort-based course will help people on levels 4-5, Showing Up Right is designed to help people on levels 1-3. I want this to become the go-to resource for anyone getting online and wants to follow the right steps. But, of course, there are still a lot of details for me to drill into. Come on! Stop dodging email marketing For the past 11 months, I've been collecting emails but I haven't done much with them. I always have this thought hovering in my mind that I don't want to be one of those people who send sales emails over and over again. Hence, I took a laid-back approach."
      }
    },
    {
      "src": "https://framerusercontent.com/images/WM6tNMStt686EM2HrmXx206Aw.jpeg",
      "alt": "",
      "filename": "blog/sep-2021-6.png",
      "context": {
        "before": "This is where I need to focus a lot in the next 1-2 months because it is time for me to drive up revenue in order to sustain my work and my family. Plan for October I've covered quite a lot above so I won't repeat my plan. But I definitely want to share this essay from Marie Poulin with you. Instead of grinding and doing everything all the time, it is best to have seasons where you focus on different priorities. For me, 2021Q4 is definitely the product development season. I'm consolidating everything I've learned to build 2 kick-ass products.",
        "after": "Hope you enjoy the read. I'm most active on Twitter, so say hi there at @MeetKevon ! 👋 Join me on my journey The best way is to subscribe to my newsletter. Subscribe Here © Kevon Cheung 2024 X Threads Instagram YouTube (()=>{function u(){function n(t,e,i){let r=document.createElement(\"a\");r.href=t,r.target=i,r.rel=e,document.body.appendChild(r),r.click(),r.remove()}function o(t){if(this.dataset.hydrated){this.removeEventListener(\"click\",o);return}t.preventDefault(),t.stopPropagation();let e=this.getAttribute(\"href\");if(!e)return;if(/Mac|iPod|iPhone|iPad/u.test(navigator.userAgent)?t.metaKey:t.ctrlKey)return n(e,\"\",\"_blank\");let r=this.getAttribute(\"rel\")??\"\",c=this.getAttribute(\"target\")??\"\";n(e,r,c)}function a(t){if(this.dataset.hydrated){this.removeEventListener(\"auxclick\",o);return}t.preventDefault(),t.stopPropagation();let e=this.getAttribute(\"href\");e&&n(e,\"\",\"_blank\")}function s(t){if(this.dataset.hydrated){this.removeEventListener(\"keydown\",s);return}if(t.key!==\"Enter\")return;t.preventDefault(),t.stopPropagation();let e=this.getAttribute(\"href\");if(!e)return;let i=this.getAttribute(\"rel\")??\"\",r=this.getAttribute(\"target\")??\"\";n(e,i,r)}document.querySelectorAll(\"[data-nested-link]\").forEach(t=>{t instanceof HTMLElement&&(t.addEventListener(\"click\",o),t.addEventListener(\"auxclick\",a),t.addEventListener(\"keydown\",s))})}return u})()()"
      }
    }
  ]
}